create schema db_b_nameconst_test;
set current_schema to 'db_b_nameconst_test';
-- 基准测试
SELECT NAME_CONST('test', 123);
 test 
------
  123
(1 row)

SELECT NAME_CONST('test', -1);
 test 
------
   -1
(1 row)

SELECT NAME_CONST('test', 1.0);
 test 
------
  1.0
(1 row)

SELECT NAME_CONST('test', -1.0);
 test 
------
 -1.0
(1 row)

SELECT NAME_CONST('test', 'test');
 test 
------
 test
(1 row)

SELECT NAME_CONST(1, 'test');
  1   
------
 test
(1 row)

SELECT NAME_CONST(0, 'test');
  0   
------
 test
(1 row)

SELECT NAME_CONST('mybool', TRUE);
 mybool 
--------
 t
(1 row)

SELECT NAME_CONST('mybig', 9223372036854775808);
        mybig        
---------------------
 9223372036854775808
(1 row)

SELECT NAME_CONST('my$name', 'Hello');
 my$name 
---------
 Hello
(1 row)

-- 其他literal
SELECT NAME_CONST(E'\x74\x65\x73\x74', U&'\0074\0065\0073\0074');
 test 
------
 test
(1 row)

SELECT NAME_CONST('test', '42'::integer);
 test 
------
   42
(1 row)

SELECT NAME_CONST('42'::int1, 'test');
  42  
------
 test
(1 row)

SELECT NAME_CONST('42'::int2, 'test');
  42  
------
 test
(1 row)

SELECT NAME_CONST('42'::int4, 'test');
  42  
------
 test
(1 row)

SELECT NAME_CONST('42'::int8, 'test');
  42  
------
 test
(1 row)

SELECT NAME_CONST('42'::int16, 'test');
  42  
------
 test
(1 row)

SELECT NAME_CONST('3.14'::double precision, 'test');
 3.14 
------
 test
(1 row)

SELECT NAME_CONST('42.1'::float4, 'test');
 42.1 
------
 test
(1 row)

SELECT NAME_CONST('42.1'::float8, 'test');
 42.1 
------
 test
(1 row)

SELECT NAME_CONST('42'::NUMERIC, 'test');
  42  
------
 test
(1 row)

SELECT NAME_CONST('test', '1'::boolean);
 test 
------
 t
(1 row)

SELECT NAME_CONST('0'::boolean, 'test');
  f   
------
 test
(1 row)

SELECT NAME_CONST('2023-06-01 00:23:59'::date, 'test');
 2023-06-01 
------------
 test
(1 row)

SELECT NAME_CONST('test', '2023-06-01 00:23:59'::time);
   test   
----------
 00:23:59
(1 row)

SELECT NAME_CONST('2023-06-01 00:23:59'::time, 'test');
 00:23:59 
----------
 test
(1 row)

SELECT NAME_CONST('test', '2023-06-01 00:23:59'::timestamp);
          test          
------------------------
 2023-06-01 00:23:59-07
(1 row)

SELECT NAME_CONST('2023-06-01 00:23:59'::timestamp, 'test');
 2023-06-01 00:23:59-07 
------------------------
 test
(1 row)

SELECT NAME_CONST('2020-01-01 00:00:01'::abstime, 123);
 2020-01-01 00:00:01-08 
------------------------
                    123
(1 row)

SELECT NAME_CONST('2020-01-01 00:00:01'::smalldatetime, 123);
 2020-01-01 00:00:00 
---------------------
                 123
(1 row)

SELECT NAME_CONST('23:25:38.691729-07'::timetz, 123);
 23:25:38.691729-07 
--------------------
                123
(1 row)

SELECT NAME_CONST('test', '59 minute'::interval);
   test    
-----------
 @ 59 mins
(1 row)

SELECT NAME_CONST('59 minute'::interval, 'test');
 @ 59 mins 
-----------
 test
(1 row)

SELECT NAME_CONST('59 minute'::reltime, 'test');
 @ 59 mins 
-----------
 test
(1 row)

SELECT NAME_CONST('2023-06-01 00:23:59'::bytea, 'test');
 \x323032332d30362d30312030303a32333a3539 
------------------------------------------
 test
(1 row)

SELECT NAME_CONST('test'::name, 123);
 test 
------
  123
(1 row)

SELECT NAME_CONST('test'::text, 123);
 test 
------
  123
(1 row)

SELECT NAME_CONST('test'::cstring, 123);
 test 
------
  123
(1 row)

SELECT NAME_CONST('test'::clob, 123);
 test 
------
  123
(1 row)

SELECT NAME_CONST('test', '2023-06-01 00:23:59'::character(15));
WARNING:  value too long for type character(15)
CONTEXT:  referenced column: name_const
      test       
-----------------
 2023-06-01 00:2
(1 row)

SELECT NAME_CONST('2023-06-01 00:23:59'::character(15), 'test');
WARNING:  value too long for type character(15)
CONTEXT:  referenced column: name_const
 2023-06-01 00:2 
-----------------
 test
(1 row)

SELECT NAME_CONST('2023-06-01 00:23:59'::char(10), 'test');
WARNING:  value too long for type character(10)
CONTEXT:  referenced column: name_const
 2023-06-01 
------------
 test
(1 row)

SELECT NAME_CONST('2023-06-01 00:23:59'::varchar(10), 'test');
 2023-06-01 
------------
 test
(1 row)

SELECT NAME_CONST('acde070d-8c4c-4f0d-9d8a-162843c10333'::uuid, 123);
 acde070d-8c4c-4f0d-9d8a-162843c10333 
--------------------------------------
                                  123
(1 row)

SELECT NAME_CONST('1.23'::money, 123);
 $1.23 
-------
   123
(1 row)

SELECT NAME_CONST(date '2021-12-31', E'\\u4F60\\u597D');
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type FuncExpr
CONTEXT:  referenced column: name_const
-- 变量测试
SET enable_set_variable_b_format = 1;
SET @var1 = 100;
SET @var2 = 'test';
SET @var3 = date '2021-12-31';
SELECT NAME_CONST('test', @var1); --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type UserVar
CONTEXT:  referenced column: name_const
SELECT NAME_CONST(@var2, 100); --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type UserVar
CONTEXT:  referenced column: name_const
SELECT NAME_CONST(@var1, @var3); --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type UserVar
CONTEXT:  referenced column: name_const
SELECT NAME_CONST(@var3, @var2); --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type UserVar
CONTEXT:  referenced column: name_const
-- NULL值和空值
SELECT NAME_CONST('test', NULL); 
 test 
------
 
(1 row)

SELECT NAME_CONST(NULL, NULL); --ERROR
ERROR:  The 'NAME_CONST' syntax is reserved for purposes internal to the openGauss server
HINT:  'NAME_CONST' can't have a NULL name.
SELECT NAME_CONST(NULL, 'test'); --ERROR
ERROR:  The 'NAME_CONST' syntax is reserved for purposes internal to the openGauss server
HINT:  'NAME_CONST' can't have a NULL name.
SELECT NAME_CONST('myempty', '');
 myempty 
---------
 
(1 row)

SELECT NAME_CONST('myspace', ' ');
 myspace 
---------
  
(1 row)

SELECT NAME_CONST('', 'test');
      
------
 test
(1 row)

SELECT NAME_CONST(' ', 'test');
      
------
 test
(1 row)

-- 超出取值范围的入参测试
SELECT NAME_CONST(-1, 'test'); --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' first argument does not accept negative numbers.
CONTEXT:  referenced column: name_const
SELECT NAME_CONST(-2.0, 'test'); --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' first argument does not accept negative numbers.
CONTEXT:  referenced column: name_const
SELECT NAME_CONST(1E+1000, 'test');
 100000000000000000000000000000000000000000000000000000000000000 
-----------------------------------------------------------------
 test
(1 row)

SELECT NAME_CONST(1E+1001, 'test'); --ERROR
ERROR:  invalid input syntax for type numeric: "1E+1001"
LINE 1: SELECT NAME_CONST(1E+1001, 'test');
                          ^
SELECT NAME_CONST('test', 1E+1000);
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   test                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 10000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
(1 row)

SELECT NAME_CONST('test', 1E+1001); --ERROR
ERROR:  invalid input syntax for type numeric: "1E+1001"
LINE 1: SELECT NAME_CONST('test', 1E+1001);
                                  ^
SELECT NAME_CONST('test', '9999-99-99 99:99:99'::time); --ERROR
WARNING:  date/time field value out of range: "9999-99-99 99:99:99"
LINE 1: SELECT NAME_CONST('test', '9999-99-99 99:99:99'::time);
                                  ^
CONTEXT:  referenced column: name_const
   test   
----------
 00:00:00
(1 row)

SELECT NAME_CONST('9999-99-99 99:99:99'::time, 'test'); --ERROR
WARNING:  date/time field value out of range: "9999-99-99 99:99:99"
LINE 1: SELECT NAME_CONST('9999-99-99 99:99:99'::time, 'test');
                          ^
CONTEXT:  referenced column: name_const
 00:00:00 
----------
 test
(1 row)

SELECT NAME_CONST('test', 'test'::integer); --ERROR
WARNING:  invalid input syntax for type integer: "test"
LINE 1: SELECT NAME_CONST('test', 'test'::integer);
                                  ^
CONTEXT:  referenced column: name_const
 test 
------
    0
(1 row)

SELECT NAME_CONST('test'::integer, 'test'); --ERROR
WARNING:  invalid input syntax for type integer: "test"
LINE 1: SELECT NAME_CONST('test'::integer, 'test');
                          ^
CONTEXT:  referenced column: name_const
  0   
------
 test
(1 row)

SELECT NAME_CONST('test', '2'::boolean);  --ERROR
ERROR:  invalid input syntax for type boolean: "2"
LINE 1: SELECT NAME_CONST('test', '2'::boolean);
                                  ^
CONTEXT:  referenced column: name_const
-- 函数及表达式
SELECT NAME_CONST('mylong', REPEAT('a', 1000)); --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type FuncExpr
CONTEXT:  referenced column: name_const
SELECT NAME_CONST(REPEAT('a', 1000), 'Hello'); --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type FuncExpr
CONTEXT:  referenced column: name_const
SELECT NAME_CONST('test', UPPER('test')); --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type FuncExpr
CONTEXT:  referenced column: name_const
SELECT NAME_CONST(UPPER('test'), 'test');--ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type FuncExpr
CONTEXT:  referenced column: name_const
SELECT NAME_CONST(CONCAT('my', 'name'), 'Hello'); --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type FuncExpr
CONTEXT:  referenced column: name_const
SELECT NAME_CONST('a', -(1 OR 2)) OR 1;
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type OpExpr
SELECT NAME_CONST('test', (1 + 2)); --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type OpExpr
CONTEXT:  referenced column: name_const
SELECT NAME_CONST((1 * 2), 'test'); --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type OpExpr
CONTEXT:  referenced column: name_const
-- MySQL的其他测试用例
CREATE TABLE t1 (a INT);
INSERT INTO t1 VALUES (1),(2),(3);
SELECT NAME_CONST('flag',1)    * MAX(a) FROM t1;
 ?column? 
----------
        3
(1 row)

SELECT NAME_CONST('flag',1.5)  * MAX(a) FROM t1;
 ?column? 
----------
      4.5
(1 row)

SELECT NAME_CONST('flag',-1)   * MAX(a) FROM t1;
 ?column? 
----------
       -3
(1 row)

SELECT NAME_CONST('flag',-1.5) * MAX(a) FROM t1;
 ?column? 
----------
     -4.5
(1 row)

SELECT NAME_CONST('flag', SQRT(4)) * MAX(a) FROM t1; --error
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type FuncExpr
SELECT NAME_CONST('flag',-SQRT(4)) * MAX(a) FROM t1; --error
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type OpExpr
DROP TABLE t1;
CREATE TABLE t1(a INT);
INSERT INTO t1 VALUES (), (), (); 
SELECT NAME_CONST(a, '1') FROM t1; --error
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type 
CONTEXT:  referenced column: name_const
SET INSERT_ID= NAME_CONST(a, a); --error
ERROR:  column "a" does not exist
LINE 1: SET INSERT_ID= NAME_CONST(a, a);
                                  ^
DROP TABLE t1;
select NAME_CONST('_id',1234) as id;
  id  
------
 1234
(1 row)

SELECT NAME_CONST('a', -(1 OR 2)) OR 1; --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type OpExpr
SELECT NAME_CONST('a', -(1 AND 2)) OR 1; --ERROR
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type OpExpr
SELECT NAME_CONST('a', -(1)) OR 1;
 ?column? 
----------
 t
(1 row)

CREATE TABLE t1 (a INT);
SELECT 1 from t1 HAVING NAME_CONST('', a); --error
ERROR:  Incorrect arguments to NAME_CONST
HINT:  'NAME_CONST' function does not accept input of type 
DROP TABLE t1;
set enable_set_variable_b_format = default;
drop schema db_b_nameconst_test cascade;
reset current_schema;
