--
-- Test All Time type under 'b' compatibility
--
drop database if exists b_time_type;
NOTICE:  database "b_time_type" does not exist, skipping
create database b_time_type dbcompatibility 'b';
\c b_time_type
-- test datetime add/substract interval
-- when b_compatibility_mode = true
set dolphin.b_compatibility_mode = true;
SELECT '1997-12-31 23:59:59' + INTERVAL 1 SECOND;
         ?column?         
--------------------------
 Thu Jan 01 00:00:00 1998
(1 row)

SELECT datetime'1997-12-31 23:59:59' + INTERVAL 1 SECOND;
         ?column?         
--------------------------
 Thu Jan 01 00:00:00 1998
(1 row)

SELECT '1997-12-31 23:59:59' - INTERVAL 1 SECOND;
         ?column?         
--------------------------
 Wed Dec 31 23:59:58 1997
(1 row)

SELECT datetime'1997-12-31 23:59:59' - INTERVAL 1 SECOND;
         ?column?         
--------------------------
 Wed Dec 31 23:59:58 1997
(1 row)

SELECT INTERVAL 1 SECOND + '1997-12-31 23:59:59';
         ?column?         
--------------------------
 Thu Jan 01 00:00:00 1998
(1 row)

SELECT INTERVAL 1 SECOND + datetime'1997-12-31 23:59:59';
         ?column?         
--------------------------
 Thu Jan 01 00:00:00 1998
(1 row)

-- when b_compatibility_mode = false;
set dolphin.b_compatibility_mode = false;
SELECT '1997-12-31 23:59:59' + INTERVAL 1 SECOND;
ERROR:  interval field value out of range: "1997-12-31 23:59:59"
LINE 1: SELECT '1997-12-31 23:59:59' + INTERVAL 1 SECOND;
               ^
SELECT datetime'1997-12-31 23:59:59' + INTERVAL 1 SECOND;
         ?column?         
--------------------------
 Thu Jan 01 00:00:00 1998
(1 row)

SELECT '1997-12-31 23:59:59' - INTERVAL 1 SECOND;
ERROR:  interval field value out of range: "1997-12-31 23:59:59"
LINE 1: SELECT '1997-12-31 23:59:59' - INTERVAL 1 SECOND;
               ^
SELECT datetime'1997-12-31 23:59:59' - INTERVAL 1 SECOND;
         ?column?         
--------------------------
 Wed Dec 31 23:59:58 1997
(1 row)

SELECT INTERVAL 1 SECOND + '1997-12-31 23:59:59';
ERROR:  interval field value out of range: "1997-12-31 23:59:59"
LINE 1: SELECT INTERVAL 1 SECOND + '1997-12-31 23:59:59';
                                   ^
SELECT INTERVAL 1 SECOND + datetime'1997-12-31 23:59:59';
         ?column?         
--------------------------
 Thu Jan 01 00:00:00 1998
(1 row)

-- test date
-- 'YYYY-MM-DD' 'YY-MM-DD'
SELECT date'2001-01-01';
    date    
------------
 01-01-2001
(1 row)

SELECT date'999-01-01';
    date    
------------
 01-01-0999
(1 row)

SELECT date'1-01-01';
    date    
------------
 01-01-0001
(1 row)

SELECT date'10120-01-01';
    date     
-------------
 01-01-10120
(1 row)

SELECT date'2000-2-29';
    date    
------------
 02-29-2000
(1 row)

SELECT date'2001-2-29';
ERROR:  date/time field value out of range: "2001-2-29"
LINE 1: SELECT date'2001-2-29';
                   ^
CONTEXT:  referenced column: date
SELECT date'2100-2-29';
ERROR:  date/time field value out of range: "2100-2-29"
LINE 1: SELECT date'2100-2-29';
                   ^
CONTEXT:  referenced column: date
SELECT date'0000-1-1';
    date    
------------
 01-01-0000
(1 row)

SELECT date'01-01';
ERROR:  invalid input syntax for type date: "01-01"
LINE 1: SELECT date'01-01';
                   ^
CONTEXT:  referenced column: date
SELECT date'9-01-01';
    date    
------------
 01-01-0009
(1 row)

SELECT date'99-01-01';
    date    
------------
 01-01-1999
(1 row)

SELECT date'999-01-01';
    date    
------------
 01-01-0999
(1 row)

SELECT date'1000-01-1';
    date    
------------
 01-01-1000
(1 row)

-- 'YYYYMMDD' or 'YYMMDD'
SELECT date'99991231';
    date    
------------
 12-31-9999
(1 row)

SELECT date'100000101';
ERROR:  invalid input syntax for type date: "100000101"
LINE 1: SELECT date'100000101';
                   ^
CONTEXT:  referenced column: date
SELECT date'10000101';
    date    
------------
 01-01-1000
(1 row)

SELECT date'9990101';
WARNING:  Incorrect date value: "9990101". "YYYYMMDD" or "YYMMDD" format is recommended.
LINE 1: SELECT date'9990101';
                   ^
CONTEXT:  referenced column: date
ERROR:  date/time field value out of range: "9990101"
LINE 1: SELECT date'9990101';
                   ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: date
SELECT date'701010';
    date    
------------
 10-10-1970
(1 row)

SELECT date'691010';
    date    
------------
 10-10-2069
(1 row)

SELECT date'691310';
ERROR:  date/time field value out of range: "691310"
LINE 1: SELECT date'691310';
                   ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: date
SELECT date'691131';
ERROR:  date/time field value out of range: "691131"
LINE 1: SELECT date'691131';
                   ^
CONTEXT:  referenced column: date
SELECT date'10101';
    date    
------------
 10-01-2010
(1 row)

SELECT date'10130';
ERROR:  date/time field value out of range: "10130"
LINE 1: SELECT date'10130';
                   ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: date
SELECT date'00120101';
    date    
------------
 01-01-0012
(1 row)

-- YYYYMMDD or YYYYMMDD
SELECT 99990101::date;
    date    
------------
 01-01-9999
(1 row)

SELECT 990101::date;
    date    
------------
 01-01-1999
(1 row)

SELECT 100::date;
ERROR:  Out of range value for date
CONTEXT:  referenced column: date
SELECT 101::date;
    date    
------------
 01-01-2000
(1 row)

SELECT 10228::date;
    date    
------------
 02-28-2001
(1 row)

SELECT 10229::date;
ERROR:  Out of range value for date
CONTEXT:  referenced column: date
SELECT 991231::date;
    date    
------------
 12-31-1999
(1 row)

SELECT 99991231::date;
    date    
------------
 12-31-9999
(1 row)

SELECT 21000228::date;
    date    
------------
 02-28-2100
(1 row)

SELECT 21000229::date;
ERROR:  Out of range value for date
CONTEXT:  referenced column: date
SELECT 100000000::date;
ERROR:  Out of range value for date
CONTEXT:  referenced column: date
SELECT 100101231::date;
ERROR:  Out of range value for date
CONTEXT:  referenced column: date
-- test time
-- '[-][D] hh:mm:ss.fsec'
SELECT time(7)'12:12:12.123456';
WARNING:  TIME(7) precision reduced to maximum allowed, 6
LINE 1: SELECT time(7)'12:12:12.123456';
               ^
CONTEXT:  referenced column: time
      time       
-----------------
 12:12:12.123456
(1 row)

SELECT time(6)'12:12:12.123456';
      time       
-----------------
 12:12:12.123456
(1 row)

SELECT time(5)'12:12:12.123456';
      time      
----------------
 12:12:12.12346
(1 row)

SELECT time(4)'12:12:12.123456';
     time      
---------------
 12:12:12.1235
(1 row)

SELECT time(3)'12:12:12.123456';
     time     
--------------
 12:12:12.123
(1 row)

SELECT time(2)'12:12:12.123456';
    time     
-------------
 12:12:12.12
(1 row)

SELECT time(1)'12:12:12.123456';
    time    
------------
 12:12:12.1
(1 row)

SELECT time(0)'12:12:12.123456';
   time   
----------
 12:12:12
(1 row)

SELECT time'12:12:12.123456';
      time       
-----------------
 12:12:12.123456
(1 row)

SELECT time'34 22:59:59.999999';
ERROR:  date/time field value out of range: "34 22:59:59.999999"
LINE 1: SELECT time'34 22:59:59.999999';
                   ^
CONTEXT:  referenced column: time
SELECT time'12:60:12.123456';
ERROR:  date/time field value out of range: "12:60:12.123456"
LINE 1: SELECT time'12:60:12.123456';
                   ^
CONTEXT:  referenced column: time
SELECT time'12:12:60.123456';
ERROR:  date/time field value out of range: "12:12:60.123456"
LINE 1: SELECT time'12:12:60.123456';
                   ^
CONTEXT:  referenced column: time
SELECT time'34 23:00:00';
ERROR:  date/time field value out of range: "34 23:00:00"
LINE 1: SELECT time'34 23:00:00';
                   ^
CONTEXT:  referenced column: time
SELECT time'-34 23:00:00';
ERROR:  date/time field value out of range: "-34 23:00:00"
LINE 1: SELECT time'-34 23:00:00';
                   ^
CONTEXT:  referenced column: time
SELECT time'34 22:59:59';
   time    
-----------
 838:59:59
(1 row)

SELECT time'-34 22:59:59';
    time    
------------
 -838:59:59
(1 row)

SELECT time'34 22:59:59.999999';
ERROR:  date/time field value out of range: "34 22:59:59.999999"
LINE 1: SELECT time'34 22:59:59.999999';
                   ^
CONTEXT:  referenced column: time
SELECT time'34 22:59:59.9999999999999999999999';
ERROR:  date/time field value out of range: "34 22:59:59.9999999999999999999999"
LINE 1: SELECT time'34 22:59:59.9999999999999999999999';
                   ^
CONTEXT:  referenced column: time
SELECT time'-34 22:59:59.9999999999999999999999';
ERROR:  date/time field value out of range: "-34 22:59:59.9999999999999999999999"
LINE 1: SELECT time'-34 22:59:59.9999999999999999999999';
                   ^
CONTEXT:  referenced column: time
SELECT time'-34 22:59:59.9999999999999999999999';
ERROR:  date/time field value out of range: "-34 22:59:59.9999999999999999999999"
LINE 1: SELECT time'-34 22:59:59.9999999999999999999999';
                   ^
CONTEXT:  referenced column: time
SELECT time'838:59:59';
   time    
-----------
 838:59:59
(1 row)

SELECT time'839:00:00';
ERROR:  date/time field value out of range: "839:00:00"
LINE 1: SELECT time'839:00:00';
                   ^
CONTEXT:  referenced column: time
SELECT time'59:59';
   time   
----------
 59:59:00
(1 row)

SELECT time'59:59.123';
     time     
--------------
 59:59:00.123
(1 row)

SELECT time'59';
   time   
----------
 00:00:59
(1 row)

SELECT time'24 24';
   time    
-----------
 600:00:00
(1 row)

SELECT time'24 12:13';
   time    
-----------
 588:13:00
(1 row)

SELECT time'59.12';
    time     
-------------
 00:00:59.12
(1 row)

SELECT time'';
   time   
----------
 00:00:00
(1 row)

SELECT time'1 09';
   time   
----------
 33:00:00
(1 row)

SELECT time'0 099';
   time   
----------
 99:00:00
(1 row)

SELECT time'-2 00000009';
   time    
-----------
 -57:00:00
(1 row)

-- 'hhmmss.fsec'
SELECT time(1)'1.123456';
    time    
------------
 00:00:01.1
(1 row)

SELECT time(2)'12.123456';
    time     
-------------
 00:00:12.12
(1 row)

SELECT time(3)'123.123456';
     time     
--------------
 00:01:23.123
(1 row)

SELECT time(4)'1234.123456';
     time      
---------------
 00:12:34.1235
(1 row)

SELECT time(5)'12345.123456';
      time      
----------------
 01:23:45.12346
(1 row)

SELECT time'123456.123456';
      time       
-----------------
 12:34:56.123456
(1 row)

-- hhmmss.fsec
SELECT 2::time;
   time   
----------
 00:00:02
(1 row)

SELECT 20::time;
   time   
----------
 00:00:20
(1 row)

SELECT 201::time;
   time   
----------
 00:02:01
(1 row)

SELECT 2011::time;
   time   
----------
 00:20:11
(1 row)

SELECT 2115.12::time;
   time   
----------
 00:21:15
(1 row)

SELECT 20115.23::time;
   time   
----------
 02:01:15
(1 row)

SELECT 233445.123::time;
   time   
----------
 23:34:45
(1 row)

SELECT 233445.123::time;
   time   
----------
 23:34:45
(1 row)

SELECT 8385959.999999::time;
ERROR:  invalid input syntax for type time: "8385959.999999"
CONTEXT:  referenced column: time
SELECT 8385959.9999999::time;
ERROR:  invalid input syntax for type time: "8385959.9999999"
CONTEXT:  referenced column: time
SELECT -232323::time;
 ?column?  
-----------
 -23:23:23
(1 row)

SELECT -8385959::time;
  ?column?  
------------
 -838:59:59
(1 row)

CREATE TABLE time_tbl (v time);
INSERT INTO time_tbl VALUES(-561234);
INSERT INTO time_tbl VALUES(-1202334);
INSERT INTO time_tbl VALUES(99991231235959);
INSERT INTO time_tbl VALUES(99991231235959.999999);
INSERT INTO time_tbl VALUES('20220-01-01');
ERROR:  invalid input syntax for type time: "20220-01-01"
LINE 1: INSERT INTO time_tbl VALUES('20220-01-01');
                                    ^
CONTEXT:  referenced column: v
-- test table's dafault typmod
INSERT INTO time_tbl VALUES(232323.123);
SELECT * FROM time_tbl;
     v      
------------
 -56:12:34
 -120:23:34
 23:59:59
 24:00:00
 23:23:23
(5 rows)

-- test alter table add [column]
ALTER TABLE time_tbl ADD COLUMN dt datetime;
ALTER TABLE time_tbl ADD ts timestamp;
INSERT INTO time_tbl VALUES(232323.555, 20201212101010.555, 20201212101010.555);
SELECT * FROM time_tbl;
     v      |            dt            |              ts              
------------+--------------------------+------------------------------
 -56:12:34  |                          | 
 -120:23:34 |                          | 
 23:59:59   |                          | 
 24:00:00   |                          | 
 23:23:23   |                          | 
 23:23:24   | Sat Dec 12 10:10:11 2020 | Sat Dec 12 10:10:11 2020 PST
(6 rows)

DROP TABLE time_tbl;
-- test alter table modify column
CREATE TABLE time_tbl (v time(2));
INSERT INTO time_tbl VALUES(232323.555);
SELECT * FROM time_tbl;
      v      
-------------
 23:23:23.56
(1 row)

ALTER TABLE time_tbl MODIFY v time;
SELECT * FROM time_tbl;
    v     
----------
 23:23:24
(1 row)

DROP TABLE time_tbl;
-- test function
SELECT time '830:12:34' + interval '3 hours';
 ?column?  
-----------
 833:12:34
(1 row)

SELECT time '830:12:34' + interval '3 minutes';
 ?column?  
-----------
 830:15:34
(1 row)

SELECT time '830:12:34' + interval '3 seconds';
 ?column?  
-----------
 830:12:37
(1 row)

SELECT time '830:12:34' + interval '26 seconds';
 ?column?  
-----------
 830:13:00
(1 row)

SELECT time '830:12:34' - interval '3 hours';
 ?column?  
-----------
 827:12:34
(1 row)

SELECT time '837:00:00' + interval '2 hours';
ERROR:  time out of range
SELECT time '838:59:59' + interval '1 second';
ERROR:  time out of range
SELECT time '-837:00:00' - interval '3 hours';
ERROR:  time out of range
SELECT time '1:00:00' - interval '3 hours';
 ?column?  
-----------
 -02:00:00
(1 row)

-- test datetime
-- 'YYYY-MM-DD hh:mm:ss.fsec' or 'YY-MM-DD hh:mm:ss.fsec'
SELECT datetime(2)'2001-01-01  23:59:59.999999';
        timestamp         
--------------------------
 Tue Jan 02 00:00:00 2001
(1 row)

SELECT datetime(3)'2001-01-01  23:59:59.9999999';
        timestamp         
--------------------------
 Tue Jan 02 00:00:00 2001
(1 row)

SELECT datetime(4)'9999-12-31  23:59:59.9999999';
         timestamp         
---------------------------
 Sat Jan 01 00:00:00 10000
(1 row)

SELECT datetime(5)'999-12-31  23:59:59.9999999';
        timestamp         
--------------------------
 Wed Jan 01 00:00:00 1000
(1 row)

SELECT datetime'99-01-01  23:59:59.123';
          timestamp           
------------------------------
 Fri Jan 01 23:59:59.123 1999
(1 row)

SELECT datetime'2001-2-28  23:59:59.123';
          timestamp           
------------------------------
 Wed Feb 28 23:59:59.123 2001
(1 row)

SELECT datetime'2000-2-28  23:59:59.123';
          timestamp           
------------------------------
 Mon Feb 28 23:59:59.123 2000
(1 row)

SELECT datetime'2000-2-28  12:23:34.5678';
           timestamp           
-------------------------------
 Mon Feb 28 12:23:34.5678 2000
(1 row)

-- 'YYYYMMDDhhmmss.fsec' or 'YYMMDDhhmmss.fsec'
SELECT datetime(1)'20010101010101.1278';
         timestamp          
----------------------------
 Mon Jan 01 01:01:01.1 2001
(1 row)

SELECT datetime(1)'010101010101.1234';
         timestamp          
----------------------------
 Mon Jan 01 01:01:01.1 2001
(1 row)

SELECT datetime(2)'0101010101';
        timestamp         
--------------------------
 Mon Jan 01 01:01:00 2001
(1 row)

SELECT datetime(1)'01010101';
        timestamp         
--------------------------
 Sat Jan 01 00:00:00 0101
(1 row)

SELECT datetime(3)'0101017';
        timestamp         
--------------------------
 Mon Jan 01 07:00:00 2001
(1 row)

SELECT datetime(1)'010101';
        timestamp         
--------------------------
 Mon Jan 01 00:00:00 2001
(1 row)

SELECT datetime(1)'10101';
        timestamp         
--------------------------
 Fri Oct 01 00:00:00 2010
(1 row)

SELECT datetime(1)'71101';
        timestamp         
--------------------------
 Fri Oct 01 00:00:00 1971
(1 row)

SELECT datetime(1)'0101';
ERROR:  invalid input syntax for type timestamp: "0101"
LINE 1: SELECT datetime(1)'0101';
                          ^
CONTEXT:  referenced column: timestamp
-- YYYYMMDDhhmmss or YYMMDDhhmmss
SELECT 11::datetime;
ERROR:  timestamp out of range
CONTEXT:  referenced column: timestamp
SELECT 111::datetime;
        timestamp         
--------------------------
 Tue Jan 11 00:00:00 2000
(1 row)

SELECT 1111::datetime;
        timestamp         
--------------------------
 Sat Nov 11 00:00:00 2000
(1 row)

SELECT 11111::datetime;
        timestamp         
--------------------------
 Sun Nov 11 00:00:00 2001
(1 row)

SELECT 111111::datetime;
        timestamp         
--------------------------
 Fri Nov 11 00:00:00 2011
(1 row)

SELECT 1111111::datetime;
        timestamp         
--------------------------
 Wed Nov 11 00:00:00 0111
(1 row)

SELECT 11111111::datetime;
        timestamp         
--------------------------
 Sat Nov 11 00:00:00 1111
(1 row)

SELECT 111111111::datetime;
        timestamp         
--------------------------
 Tue Jan 11 11:11:11 2000
(1 row)

SELECT 1111111111::datetime;
        timestamp         
--------------------------
 Sat Nov 11 11:11:11 2000
(1 row)

SELECT 11111111111::datetime;
        timestamp         
--------------------------
 Sun Nov 11 11:11:11 2001
(1 row)

SELECT 111111111111::datetime;
        timestamp         
--------------------------
 Fri Nov 11 11:11:11 2011
(1 row)

SELECT 1111111111111::datetime;
        timestamp         
--------------------------
 Wed Nov 11 11:11:11 0111
(1 row)

SELECT 11111111111111::datetime;
        timestamp         
--------------------------
 Sat Nov 11 11:11:11 1111
(1 row)

-- test datetime operation
create table test_dt(dt datetime);
insert into test_dt values('1997-11-10');
insert into test_dt values('2000-11-10');
insert into test_dt values('1997-11-10');
insert into test_dt values('2012-11-10');
insert into test_dt values('2008-11-10');
insert into test_dt values('1994-11-10');
select max(dt) from test_dt;
           max            
--------------------------
 Sat Nov 10 00:00:00 2012
(1 row)

select min(dt) from test_dt;
           min            
--------------------------
 Thu Nov 10 00:00:00 1994
(1 row)

select distinct(dt) from test_dt;
            dt            
--------------------------
 Fri Nov 10 00:00:00 2000
 Mon Nov 10 00:00:00 2008
 Thu Nov 10 00:00:00 1994
 Mon Nov 10 00:00:00 1997
 Sat Nov 10 00:00:00 2012
(5 rows)

select * from test_dt;
            dt            
--------------------------
 Mon Nov 10 00:00:00 1997
 Fri Nov 10 00:00:00 2000
 Mon Nov 10 00:00:00 1997
 Sat Nov 10 00:00:00 2012
 Mon Nov 10 00:00:00 2008
 Thu Nov 10 00:00:00 1994
(6 rows)

create index on test_dt(dt);
select * from test_dt where dt > '2007-01-01';
            dt            
--------------------------
 Sat Nov 10 00:00:00 2012
 Mon Nov 10 00:00:00 2008
(2 rows)

select * from test_dt where dt = '1997-11-10';
            dt            
--------------------------
 Mon Nov 10 00:00:00 1997
 Mon Nov 10 00:00:00 1997
(2 rows)

select * from test_dt where dt < '1997-11-10';
            dt            
--------------------------
 Thu Nov 10 00:00:00 1994
(1 row)

-- test now() and current_timestamp
create table test_datetime(c1 datetime);
insert into test_datetime values(now());
insert into test_datetime values(current_timestamp);
drop table test_datetime;
-- test timestamp with[out] timezone
select timestamp with time zone'1994-11-10 23:12:34.5678';
            timestamptz            
-----------------------------------
 Thu Nov 10 23:12:34.5678 1994 PST
(1 row)

select timestamp without time zone'1994-11-10 23:12:34.5678';
           timestamp           
-------------------------------
 Thu Nov 10 23:12:34.5678 1994
(1 row)

select timestamp'1994-11-10 23:12:34.5678';
           timestamp           
-------------------------------
 Thu Nov 10 23:12:34.5678 1994
(1 row)

-- test timestamp
set time zone 'PRC';
CREATE TABLE timestamp_tbl (v timestamp(2));
-- 'YYYY-MM-DD hh:mm:ss.fsec' or 'YY-MM-DD hh:mm:ss.fsec'
INSERT INTO timestamp_tbl VALUES ('2001-01-01  23:59:59.999999');
INSERT INTO timestamp_tbl VALUES ('2001-01-01  23:59:59.9999999');
INSERT INTO timestamp_tbl VALUES ('9999-12-31  23:59:59.9999999');
INSERT INTO timestamp_tbl VALUES ('999-12-31  23:59:59.9999999');
INSERT INTO timestamp_tbl VALUES ('99-01-01  23:59:59.123');
INSERT INTO timestamp_tbl VALUES ('2001-2-28  23:59:59.123');
INSERT INTO timestamp_tbl VALUES ('2000-2-28  23:59:59.123');
-- 'YYYYMMDDhhmmss.fsec' or 'YYMMDDhhmmss.fsec'
INSERT INTO timestamp_tbl VALUES ('20010101010101.1278');
INSERT INTO timestamp_tbl VALUES ('010101010101.1234');
INSERT INTO timestamp_tbl VALUES ('0101010101');
INSERT INTO timestamp_tbl VALUES ('01010101');
INSERT INTO timestamp_tbl VALUES ('0101017');
INSERT INTO timestamp_tbl VALUES ('010101');
INSERT INTO timestamp_tbl VALUES ('0101');
ERROR:  invalid input syntax for type timestamp: "0101"
LINE 1: INSERT INTO timestamp_tbl VALUES ('0101');
                                          ^
CONTEXT:  referenced column: v
-- YYYYMMDDhhmmss or YYMMDDhhmmss
INSERT INTO timestamp_tbl VALUES (11);
ERROR:  timestamp out of range
CONTEXT:  referenced column: v
INSERT INTO timestamp_tbl VALUES (111);
INSERT INTO timestamp_tbl VALUES (1111);
INSERT INTO timestamp_tbl VALUES (11111);
INSERT INTO timestamp_tbl VALUES (111111);
INSERT INTO timestamp_tbl VALUES (1111111);
INSERT INTO timestamp_tbl VALUES (11111111);
INSERT INTO timestamp_tbl VALUES (111111111);
INSERT INTO timestamp_tbl VALUES (1111111111);
INSERT INTO timestamp_tbl VALUES (11111111111);
INSERT INTO timestamp_tbl VALUES (111111111111);
INSERT INTO timestamp_tbl VALUES (1111111111111);
INSERT INTO timestamp_tbl VALUES (11111111111111);
SELECT * FROM timestamp_tbl;
                v                
---------------------------------
 Tue Jan 02 00:00:00 2001 CST
 Tue Jan 02 00:00:00 2001 CST
 Sat Jan 01 00:00:00 10000 CST
 Wed Jan 01 00:00:00 1000 LMT
 Fri Jan 01 23:59:59.12 1999 CST
 Wed Feb 28 23:59:59.12 2001 CST
 Mon Feb 28 23:59:59.12 2000 CST
 Mon Jan 01 01:01:01.13 2001 CST
 Mon Jan 01 01:01:01.12 2001 CST
 Mon Jan 01 01:01:00 2001 CST
 Sat Jan 01 00:00:00 0101 LMT
 Mon Jan 01 07:00:00 2001 CST
 Mon Jan 01 00:00:00 2001 CST
 Tue Jan 11 00:00:00 2000 CST
 Sat Nov 11 00:00:00 2000 CST
 Sun Nov 11 00:00:00 2001 CST
 Fri Nov 11 00:00:00 2011 CST
 Wed Nov 11 00:00:00 0111 LMT
 Sat Nov 11 00:00:00 1111 LMT
 Tue Jan 11 11:11:11 2000 CST
 Sat Nov 11 11:11:11 2000 CST
 Sun Nov 11 11:11:11 2001 CST
 Fri Nov 11 11:11:11 2011 CST
 Wed Nov 11 11:11:11 0111 LMT
 Sat Nov 11 11:11:11 1111 LMT
(25 rows)

set time zone 'UTC';
SELECT * FROM timestamp_tbl;
                v                
---------------------------------
 Mon Jan 01 16:00:00 2001 UTC
 Mon Jan 01 16:00:00 2001 UTC
 Fri Dec 31 16:00:00 9999 UTC
 Tue Dec 31 15:54:17 0999 UTC
 Fri Jan 01 15:59:59.12 1999 UTC
 Wed Feb 28 15:59:59.12 2001 UTC
 Mon Feb 28 15:59:59.12 2000 UTC
 Sun Dec 31 17:01:01.13 2000 UTC
 Sun Dec 31 17:01:01.12 2000 UTC
 Sun Dec 31 17:01:00 2000 UTC
 Fri Dec 31 15:54:17 0100 UTC
 Sun Dec 31 23:00:00 2000 UTC
 Sun Dec 31 16:00:00 2000 UTC
 Mon Jan 10 16:00:00 2000 UTC
 Fri Nov 10 16:00:00 2000 UTC
 Sat Nov 10 16:00:00 2001 UTC
 Thu Nov 10 16:00:00 2011 UTC
 Tue Nov 10 15:54:17 0111 UTC
 Fri Nov 10 15:54:17 1111 UTC
 Tue Jan 11 03:11:11 2000 UTC
 Sat Nov 11 03:11:11 2000 UTC
 Sun Nov 11 03:11:11 2001 UTC
 Fri Nov 11 03:11:11 2011 UTC
 Wed Nov 11 03:05:28 0111 UTC
 Sat Nov 11 03:05:28 1111 UTC
(25 rows)

set time zone 'PRC';
DROP TABLE timestamp_tbl;
-- test YEAR
DROP TABLE IF EXISTS year_tbl;
NOTICE:  table "year_tbl" does not exist, skipping
-- test invalid display width
CREATE TABLE year_tbl (y YEAR(-1));
ERROR:  invalid display width and use YEAR instead
CREATE TABLE year_tbl (y YEAR(0));
ERROR:  invalid display width and use YEAR instead
CREATE TABLE year_tbl (y YEAR(1));
ERROR:  invalid display width and use YEAR instead
CREATE TABLE year_tbl (y YEAR(3));
ERROR:  invalid display width and use YEAR instead
CREATE TABLE year_tbl (y YEAR(5));
ERROR:  invalid display width and use YEAR instead
CREATE TABLE year_tbl (y YEAR(4294967297));
ERROR:  value "4294967297" is out of range for type integer
-- test YEAR YEAR(2) YEAR(4)
CREATE TABLE year_tbl (y YEAR, y4 YEAR(4), y2 YEAR(2));
INSERT INTO year_tbl VALUES (1900, 1900, 1900);
ERROR:  Out of range value for year data type!
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES ('1900', '1900', '1900');
ERROR:  Out of range value for year data type!
LINE 1: INSERT INTO year_tbl VALUES ('1900', '1900', '1900');
                                     ^
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES (2156, 2156, 2156);
ERROR:  Out of range value for year data type!
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES ('2156', '2156', '2156');
ERROR:  Out of range value for year data type!
LINE 1: INSERT INTO year_tbl VALUES ('2156', '2156', '2156');
                                     ^
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES (1901, 1901, 1901);
INSERT INTO year_tbl VALUES ('1901', '1901', '1901');
INSERT INTO year_tbl VALUES (2155, 2155, 2155);
INSERT INTO year_tbl VALUES ('2155', '2155', '2155');
INSERT INTO year_tbl VALUES (70, 70, 70);
INSERT INTO year_tbl VALUES ('70', '70', '70');
INSERT INTO year_tbl VALUES (69, 69, 69);
INSERT INTO year_tbl VALUES ('69', '69', '69');
INSERT INTO year_tbl VALUES (2156, 2156, 2156);
ERROR:  Out of range value for year data type!
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES ('2156', '2156', '2156');
ERROR:  Out of range value for year data type!
LINE 1: INSERT INTO year_tbl VALUES ('2156', '2156', '2156');
                                     ^
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES (-1, -1, -1);
ERROR:  Out of range value for year data type!
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES ('-1', '-1', '-1');
ERROR:  Invalid integer value: "-1"
LINE 1: INSERT INTO year_tbl VALUES ('-1', '-1', '-1');
                                     ^
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES (0, 0, 0);
INSERT INTO year_tbl VALUES ('0', '0', '0');
INSERT INTO year_tbl VALUES ('00', '00', '00');
INSERT INTO year_tbl VALUES ('000', '000', '000');
INSERT INTO year_tbl VALUES ('0000', '0000', '0000');
INSERT INTO year_tbl VALUES (1, 1, 1);
INSERT INTO year_tbl VALUES ('1', '1', '1');
SELECT * FROM year_tbl;
  y   |  y4  | y2 
------+------+----
 1901 | 1901 | 01
 1901 | 1901 | 01
 2155 | 2155 | 55
 2155 | 2155 | 55
 1970 | 1970 | 70
 1970 | 1970 | 70
 2069 | 2069 | 69
 2069 | 2069 | 69
 0    | 0    | 0
 2000 | 2000 | 00
 2000 | 2000 | 00
 2000 | 2000 | 00
 0    | 0    | 0
 2001 | 2001 | 01
 2001 | 2001 | 01
(15 rows)

-- test order by
SELECT * FROM year_tbl ORDER BY y ASC;
  y   |  y4  | y2 
------+------+----
 0    | 0    | 0
 0    | 0    | 0
 1901 | 1901 | 01
 1901 | 1901 | 01
 1970 | 1970 | 70
 1970 | 1970 | 70
 2000 | 2000 | 00
 2000 | 2000 | 00
 2000 | 2000 | 00
 2001 | 2001 | 01
 2001 | 2001 | 01
 2069 | 2069 | 69
 2069 | 2069 | 69
 2155 | 2155 | 55
 2155 | 2155 | 55
(15 rows)

-- test max, min, distinct
SELECT max(y), min(y4) FROM year_tbl;
 max  | min 
------+-----
 2155 | 0
(1 row)

SELECT distinct(y) FROM year_tbl;
  y   
------
 0
 1901
 1970
 2000
 2001
 2069
 2155
(7 rows)

-- test index
CREATE INDEX test_b_tree_idx ON year_tbl(y);
DROP INDEX test_b_tree_idx;
DROP TABLE year_tbl;
-- test operation of YEAR and YEAR(2)
SELECT ('2010')::YEAR(2)<(2001)::YEAR;
 ?column? 
----------
 f
(1 row)

SELECT ('2010')::YEAR(2)>(2001)::YEAR;
 ?column? 
----------
 t
(1 row)

SELECT ('2010')::YEAR(2)>(2001);
 ?column? 
----------
 t
(1 row)

SELECT (2010)>(2001)::YEAR;
 ?column? 
----------
 t
(1 row)

SELECT (2001)=(2001)::YEAR;
 ?column? 
----------
 t
(1 row)

SELECT (2001)=(2001)::YEAR(2);
 ?column? 
----------
 t
(1 row)

-- test operation of year and YEAR(2)
SELECT (2010)::YEAR-(2001)::YEAR;
 ?column?  
-----------
 @ 9 years
(1 row)

SELECT (2010)::YEAR-(2111)::YEAR;
    ?column?     
-----------------
 @ 101 years ago
(1 row)

SELECT (2010)::YEAR-(2111)::YEAR;
    ?column?     
-----------------
 @ 101 years ago
(1 row)

SELECT (2010)::YEAR-(interval '2' year);
 ?column? 
----------
 2008
(1 row)

SELECT (2010)::YEAR+(interval '2' year);
 ?column? 
----------
 2012
(1 row)

SELECT (1970)::YEAR-(interval '69' year);
 ?column? 
----------
 1901
(1 row)

SELECT (1970)::YEAR-(interval '70' year);
ERROR:  Out of range value for year data type!
SELECT (2069)::YEAR+(interval '86' year);
 ?column? 
----------
 2155
(1 row)

SELECT (2069)::YEAR+(interval '87' year);
ERROR:  Out of range value for year data type!
SELECT (2069)::YEAR+(interval'366day');
 ?column? 
----------
 2070
(1 row)

SELECT (2010)::YEAR(2)-(2001)::YEAR(2);
 ?column?  
-----------
 @ 9 years
(1 row)

SELECT (2010)::YEAR(2)-(2111)::YEAR;
    ?column?     
-----------------
 @ 101 years ago
(1 row)

SELECT (2010)::YEAR-(2111)::YEAR(2);
    ?column?     
-----------------
 @ 101 years ago
(1 row)

SELECT (2010)::YEAR(2)-(interval '2' year);
 ?column? 
----------
 08
(1 row)

SELECT (2010)::YEAR(2)+(interval '2' year);
 ?column? 
----------
 12
(1 row)

SELECT (1970)::YEAR(2)-(interval '69' year);
 ?column? 
----------
 01
(1 row)

SELECT (1970)::YEAR(2)-(interval '70' year);
ERROR:  Out of range value for year data type!
SELECT (2069)::YEAR(2)+(interval '86' year);
 ?column? 
----------
 55
(1 row)

SELECT (2069)::YEAR(2)+(interval '87' year);
ERROR:  Out of range value for year data type!
SELECT (2069)::YEAR(2)+(interval'366day');
 ?column? 
----------
 70
(1 row)

-- test year +/- integer
create table t_year0035(ts1 year(4) ,ts2 integer);
insert into t_year0035 values('1904','1');
insert into t_year0035 values('1902','2');
insert into t_year0035 values('1907','5');
select ts1 + ts2 from t_year0035;
 ?column? 
----------
     1905
     1904
     1912
(3 rows)

select ts2 + ts1 from t_year0035;
 ?column? 
----------
     1905
     1904
     1912
(3 rows)

select ts1 - ts2 from t_year0035;
 ?column? 
----------
     1903
     1900
     1902
(3 rows)

select ts2 - ts1 from t_year0035;
 ?column? 
----------
    -1903
    -1900
    -1902
(3 rows)

drop table t_year0035;
-- test overflow
select integer'2147481650' + year'1998';
ERROR:  integer out of range
select year'1998' + integer'2147481650';
ERROR:  integer out of range
select integer'-2147481651' - year'1997';
  ?column?   
-------------
 -2147483648
(1 row)

-- test year input
select year '20$#12';
ERROR:  Incorrect integer value: "20$#12"
LINE 1: select year '20$#12';
                    ^
CONTEXT:  referenced column: year
select year '20中文12';
ERROR:  Incorrect integer value: "20中文12"
LINE 1: select year '20中文12';
                    ^
CONTEXT:  referenced column: year
select year '    1997    ';
 year 
------
 1997
(1 row)

select year '  1997';
 year 
------
 1997
(1 row)

select year '1997  ';
 year 
------
 1997
(1 row)

select year ' 1997  89';
ERROR:  Incorrect integer value: " 1997  89"
LINE 1: select year ' 1997  89';
                    ^
CONTEXT:  referenced column: year
select year ' 1997  #@#';
ERROR:  Incorrect integer value: " 1997  #@#"
LINE 1: select year ' 1997  #@#';
                    ^
CONTEXT:  referenced column: year
select year '&%2122';
ERROR:  Invalid integer value: "&%2122"
LINE 1: select year '&%2122';
                    ^
CONTEXT:  referenced column: year
select year '中文2122';
ERROR:  Invalid integer value: "中文2122"
LINE 1: select year '中文2122';
                    ^
CONTEXT:  referenced column: year
-- test partition key
CREATE TABLESPACE b_time_type_example RELATIVE LOCATION 'tablespace1/tablespace_1';
-- year range key
CREATE TABLE y_range
(
    y year
)
TABLESPACE b_time_type_example
PARTITION BY RANGE(y)
(
    PARTITION P1 VALUES LESS THAN(2000),
    PARTITION P2 VALUES LESS THAN(2050)
)
ENABLE ROW MOVEMENT;
INSERT INTO y_range VALUES(1997);
INSERT INTO y_range VALUES(2030);
INSERT INTO y_range VALUES(2060);
ERROR:  inserted partition key does not map to any table partition
SELECT * FROM y_range;
  y   
------
 1997
 2030
(2 rows)

SELECT * FROM y_range PARTITION(P1);
  y   
------
 1997
(1 row)

SELECT * FROM y_range PARTITION(P2);
  y   
------
 2030
(1 row)

DROP TABLE y_range;
-- time range key
CREATE TABLE ti_range
(
    t time
)
TABLESPACE b_time_type_example
PARTITION BY RANGE(t)
(
        PARTITION P1 VALUES LESS THAN('-12:00:00'),
        PARTITION P2 VALUES LESS THAN('48:00:00')
)
ENABLE ROW MOVEMENT;
INSERT INTO ti_range VALUES('-20:00:00');
INSERT INTO ti_range VALUES('20:00:00');
INSERT INTO ti_range VALUES('120:00:00');
ERROR:  inserted partition key does not map to any table partition
SELECT * FROM ti_range;
     t     
-----------
 -20:00:00
 20:00:00
(2 rows)

SELECT * FROM ti_range PARTITION(P1);
     t     
-----------
 -20:00:00
(1 row)

SELECT * FROM ti_range PARTITION(P2);
    t     
----------
 20:00:00
(1 row)

DROP TABLE ti_range;
-- year list key
CREATE TABLE y_list
(
    y year
)
TABLESPACE b_time_type_example
PARTITION BY LIST(y)
(
    PARTITION P1 VALUES IN(1991, 1997, 2000),
    PARTITION P2 VALUES IN(1992, 1998, 2010)
)
ENABLE ROW MOVEMENT;
INSERT INTO y_list VALUES(1991);
INSERT INTO y_list VALUES(1997);
INSERT INTO y_list VALUES(2000);
INSERT INTO y_list VALUES(1992);
INSERT INTO y_list VALUES(1998);
INSERT INTO y_list VALUES(2010);
INSERT INTO y_list VALUES(2011);
ERROR:  inserted partition key does not map to any table partition
INSERT INTO y_list VALUES(1990);
ERROR:  inserted partition key does not map to any table partition
SELECT * FROM y_list ORDER BY y;
  y   
------
 1991
 1992
 1997
 1998
 2000
 2010
(6 rows)

SELECT * FROM y_list PARTITION(P1);
  y   
------
 1991
 1997
 2000
(3 rows)

SELECT * FROM y_list PARTITION(P2);
  y   
------
 1992
 1998
 2010
(3 rows)

DROP TABLE y_list;
-- time list key
CREATE TABLE ti_list
(
    t time
)
TABLESPACE b_time_type_example
PARTITION BY LIST(t)
(
        PARTITION P1 VALUES IN('12:00:00', '60000', '-3:0:0'),
        PARTITION P2 VALUES IN('2:0:0', '-5:0:0')
)
ENABLE ROW MOVEMENT;
INSERT INTO ti_list VALUES('12:00:00');
INSERT INTO ti_list VALUES('02:00:00');
INSERT INTO ti_list VALUES('6:00:00');
INSERT INTO ti_list VALUES('-30000');
INSERT INTO ti_list VALUES('-50000');
INSERT INTO ti_list VALUES('3:12:12');
ERROR:  inserted partition key does not map to any table partition
SELECT * FROM ti_list;
     t     
-----------
 02:00:00
 -05:00:00
 12:00:00
 06:00:00
 -03:00:00
(5 rows)

SELECT * FROM ti_list PARTITION(P1);
     t     
-----------
 12:00:00
 06:00:00
 -03:00:00
(3 rows)

SELECT * FROM ti_list PARTITION(P2);
     t     
-----------
 02:00:00
 -05:00:00
(2 rows)

DROP TABLE ti_list;
-- year hash key
CREATE TABLE y_hash
(
    y year
)
TABLESPACE b_time_type_example
PARTITION BY HASH(y)
(
    PARTITION P1,
    PARTITION P2,
    PARTITION P3,
    PARTITION P4
);
INSERT INTO y_hash VALUES(1991);
INSERT INTO y_hash VALUES(2010);
INSERT INTO y_hash VALUES(2054);
INSERT INTO y_hash VALUES(2056);
INSERT INTO y_hash VALUES(2000);
INSERT INTO y_hash VALUES(1992);
INSERT INTO y_hash VALUES(1998);
INSERT INTO y_hash VALUES(1970);
INSERT INTO y_hash VALUES(1980);
INSERT INTO y_hash VALUES(2133);
INSERT INTO y_hash VALUES(2100);
INSERT INTO y_hash VALUES(2122);
SELECT * FROM y_hash;
  y   
------
 1970
 2133
 2122
 2054
 2056
 2000
 1998
 1980
 2100
 1991
 2010
 1992
(12 rows)

SELECT * FROM y_hash PARTITION(P1);
  y   
------
 1991
 2010
 1992
(3 rows)

SELECT * FROM y_hash PARTITION(P2);
  y   
------
 1980
 2100
(2 rows)

SELECT * FROM y_hash PARTITION(P3);
  y   
------
 2054
 2056
 2000
 1998
(4 rows)

SELECT * FROM y_hash PARTITION(P4);
  y   
------
 1970
 2133
 2122
(3 rows)

DROP TABLE y_hash;
-- time hash key
CREATE TABLE ti_hash
(
    ti time
)
TABLESPACE b_time_type_example
PARTITION BY HASH(ti)
(
    PARTITION P1,
    PARTITION P2
);
INSERT INTO ti_hash VALUES('12:1:1');
INSERT INTO ti_hash VALUES('12:1:2');
INSERT INTO ti_hash VALUES('12:1:3');
INSERT INTO ti_hash VALUES('12:1:4');
INSERT INTO ti_hash VALUES('12:1:5');
SELECT * FROM ti_hash;
    ti    
----------
 12:01:01
 12:01:03
 12:01:04
 12:01:05
 12:01:02
(5 rows)

SELECT * FROM ti_hash PARTITION(P1);
    ti    
----------
 12:01:02
(1 row)

SELECT * FROM ti_hash PARTITION(P2);
    ti    
----------
 12:01:01
 12:01:03
 12:01:04
 12:01:05
(4 rows)

DROP TABLE ti_hash;
-- test cast function
SELECT cast(-232323.555 as time);
   time    
-----------
 -23:23:24
(1 row)

SELECT cast('20121010101010.555' as datetime);
        timestamp         
--------------------------
 Wed Oct 10 10:10:11 2012
(1 row)

-- test time type operations
select ('2001-10-10 11:11:59.123456'::time(6) + 1);
   ?column?    
---------------
 111160.123456
(1 row)

select ('2001-10-10 11:11:59.123456'::time(6) - 1);
   ?column?    
---------------
 111158.123456
(1 row)

select ('2001-10-10 11:11:59.123456'::time(6) / 2);
   ?column?   
--------------
 55579.561728
(1 row)

select ('2001-10-10 11:11:59.123456'::datetime(6) + 1);
     ?column?     
------------------
 20011010111160.1
(1 row)

select ('2001-10-10 11:11:59.123456'::datetime(6) - 1);
     ?column?     
------------------
 20011010111158.1
(1 row)

select ('2001-10-10 11:11:59.123456'::datetime(6) / 2);
     ?column?     
------------------
 10005505055579.6
(1 row)

-- no strict mode
set dolphin.sql_mode = '';
CREATE TABLE time_tbl (v time);
INSERT INTO time_tbl VALUES('20220-01-01');
select * from time_tbl;
    v     
----------
 02:02:20
(1 row)

DROP TABLE time_tbl;
-- test sql_mode NO_ZERO_DATE
CREATE TABLE t_NO_ZERO_DATE_date(v date);
CREATE TABLE t_NO_ZERO_DATE_datetime(v datetime);
CREATE TABLE t_NO_ZERO_DATE_timestamp(v timestamp);
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES(0);
ERROR:  Out of range value for date
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-00');
ERROR:  date/time field value out of range: "0000-00-00"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-00');
                                                  ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-01');
ERROR:  date/time field value out of range: "0000-00-01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-01');
                                                  ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-01-00');
ERROR:  date/time field value out of range: "0000-01-00"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-01-00');
                                                  ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('2000-00-00');
ERROR:  date/time field value out of range: "2000-00-00"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('2000-00-00');
                                                  ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-00 10:01');
ERROR:  date/time field value out of range: "0000-00-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-00 10...
                                                      ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-01 10:01');
ERROR:  date/time field value out of range: "0000-00-01 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-01 10...
                                                      ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-01-00 10:01');
ERROR:  date/time field value out of range: "0000-01-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-01-00 10...
                                                      ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('2000-00-00 10:01');
ERROR:  date/time field value out of range: "2000-00-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('2000-00-00 10...
                                                      ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-00 10:01');
ERROR:  date/time field value out of range: "0000-00-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-00 1...
                                                       ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-01 10:01');
ERROR:  date/time field value out of range: "0000-00-01 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-01 1...
                                                       ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-01-00 10:01');
ERROR:  date/time field value out of range: "0000-01-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-01-00 1...
                                                       ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('2000-00-00 10:01');
ERROR:  date/time field value out of range: "2000-00-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('2000-00-00 1...
                                                       ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: v
SET dolphin.sql_mode = 'sql_mode_strict,sql_mode_full_group';
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES(0);
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-00');
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-01');
ERROR:  date/time field value out of range: "0000-00-01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-01');
                                                  ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-01-00');
ERROR:  date/time field value out of range: "0000-01-00"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-01-00');
                                                  ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('2000-00-00');
ERROR:  date/time field value out of range: "2000-00-00"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('2000-00-00');
                                                  ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-00 10:01');
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-01 10:01');
ERROR:  date/time field value out of range: "0000-00-01 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-01 10...
                                                      ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-01-00 10:01');
ERROR:  date/time field value out of range: "0000-01-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-01-00 10...
                                                      ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('2000-00-00 10:01');
ERROR:  date/time field value out of range: "2000-00-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('2000-00-00 10...
                                                      ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-00 10:01');
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-01 10:01');
ERROR:  date/time field value out of range: "0000-00-01 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-01 1...
                                                       ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-01-00 10:01');
ERROR:  date/time field value out of range: "0000-01-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-01-00 1...
                                                       ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('2000-00-00 10:01');
ERROR:  date/time field value out of range: "2000-00-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('2000-00-00 1...
                                                       ^
CONTEXT:  referenced column: v
SELECT * FROM t_NO_ZERO_DATE_date;
     v      
------------
 00-00-0000
 00-00-0000
(2 rows)

SELECT * FROM t_NO_ZERO_DATE_datetime;
          v          
---------------------
 0000-00-00 10:01:00
(1 row)

SELECT * FROM t_NO_ZERO_DATE_timestamp;
              v               
------------------------------
 0000-00-00 10:01:00+08:05:43
(1 row)

DROP TABLE t_NO_ZERO_DATE_date;
DROP TABLE t_NO_ZERO_DATE_datetime;
DROP TABLE t_NO_ZERO_DATE_timestamp;
RESET dolphin.sql_mode;
\c postgres
DROP DATABASE b_time_type;
DROP TABLESPACE b_time_type_example;
