--
-- Test All Time type under 'b' compatibility
--
drop database if exists b_time_type;
NOTICE:  database "b_time_type" does not exist, skipping
create database b_time_type dbcompatibility 'b';
\c b_time_type
-- test datetime add/substract interval
-- when b_compatibility_mode = true
set dolphin.b_compatibility_mode = true;
SELECT '1997-12-31 23:59:59' + INTERVAL 1 SECOND;
      ?column?       
---------------------
 1998-01-01 00:00:00
(1 row)

SELECT datetime'1997-12-31 23:59:59' + INTERVAL 1 SECOND;
      ?column?       
---------------------
 1998-01-01 00:00:00
(1 row)

SELECT '1997-12-31 23:59:59' - INTERVAL 1 SECOND;
      ?column?       
---------------------
 1997-12-31 23:59:58
(1 row)

SELECT datetime'1997-12-31 23:59:59' - INTERVAL 1 SECOND;
      ?column?       
---------------------
 1997-12-31 23:59:58
(1 row)

SELECT INTERVAL 1 SECOND + '1997-12-31 23:59:59';
      ?column?       
---------------------
 1998-01-01 00:00:00
(1 row)

SELECT INTERVAL 1 SECOND + datetime'1997-12-31 23:59:59';
      ?column?       
---------------------
 1998-01-01 00:00:00
(1 row)

-- when b_compatibility_mode = false;
set dolphin.b_compatibility_mode = false;
SELECT '1997-12-31 23:59:59' + INTERVAL 1 SECOND;
WARNING:  interval field value out of range: "1997-12-31 23:59:59"
LINE 1: SELECT '1997-12-31 23:59:59' + INTERVAL 1 SECOND;
               ^
 ?column? 
----------
 @ 1 sec
(1 row)

SELECT datetime'1997-12-31 23:59:59' + INTERVAL 1 SECOND;
      ?column?       
---------------------
 1998-01-01 00:00:00
(1 row)

SELECT '1997-12-31 23:59:59' - INTERVAL 1 SECOND;
WARNING:  interval field value out of range: "1997-12-31 23:59:59"
LINE 1: SELECT '1997-12-31 23:59:59' - INTERVAL 1 SECOND;
               ^
  ?column?   
-------------
 @ 1 sec ago
(1 row)

SELECT datetime'1997-12-31 23:59:59' - INTERVAL 1 SECOND;
      ?column?       
---------------------
 1997-12-31 23:59:58
(1 row)

SELECT INTERVAL 1 SECOND + '1997-12-31 23:59:59';
WARNING:  interval field value out of range: "1997-12-31 23:59:59"
LINE 1: SELECT INTERVAL 1 SECOND + '1997-12-31 23:59:59';
                                   ^
 ?column? 
----------
 @ 1 sec
(1 row)

SELECT INTERVAL 1 SECOND + datetime'1997-12-31 23:59:59';
      ?column?       
---------------------
 1998-01-01 00:00:00
(1 row)

-- test date
-- 'YYYY-MM-DD' 'YY-MM-DD'
SELECT date'2001-01-01';
    date    
------------
 2001-01-01
(1 row)

SELECT date'999-01-01';
    date    
------------
 0999-01-01
(1 row)

SELECT date'1-01-01';
    date    
------------
 0001-01-01
(1 row)

SELECT date'10120-01-01';
    date     
-------------
 10120-01-01
(1 row)

SELECT date'2000-2-29';
    date    
------------
 2000-02-29
(1 row)

SELECT date'2001-2-29';
ERROR:  date/time field value out of range: "2001-2-29"
CONTEXT:  referenced column: date
SELECT date'2100-2-29';
ERROR:  date/time field value out of range: "2100-2-29"
CONTEXT:  referenced column: date
SELECT date'0000-1-1';
    date    
------------
 0000-01-01
(1 row)

SELECT date'01-01';
ERROR:  invalid input syntax for type date: "01-01"
CONTEXT:  referenced column: date
SELECT date'9-01-01';
    date    
------------
 0009-01-01
(1 row)

SELECT date'99-01-01';
    date    
------------
 1999-01-01
(1 row)

SELECT date'999-01-01';
    date    
------------
 0999-01-01
(1 row)

SELECT date'1000-01-1';
    date    
------------
 1000-01-01
(1 row)

-- 'YYYYMMDD' or 'YYMMDD'
SELECT date'99991231';
    date    
------------
 9999-12-31
(1 row)

SELECT date'100000101';
ERROR:  date/time field value out of range: "100000101"
CONTEXT:  referenced column: date
SELECT date'10000101';
    date    
------------
 1000-01-01
(1 row)

SELECT date'9990101';
ERROR:  date/time field value out of range: "9990101"
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: date
SELECT date'701010';
    date    
------------
 1970-10-10
(1 row)

SELECT date'691010';
    date    
------------
 2069-10-10
(1 row)

SELECT date'691310';
ERROR:  date/time field value out of range: "691310"
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: date
SELECT date'691131';
ERROR:  date/time field value out of range: "691131"
CONTEXT:  referenced column: date
SELECT date'10101';
    date    
------------
 2010-10-01
(1 row)

SELECT date'10130';
ERROR:  date/time field value out of range: "10130"
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: date
SELECT date'00120101';
    date    
------------
 0012-01-01
(1 row)

-- YYYYMMDD or YYYYMMDD
SELECT 99990101::date;
    date    
------------
 9999-01-01
(1 row)

SELECT 990101::date;
    date    
------------
 1999-01-01
(1 row)

SELECT 100::date;
WARNING:  Out of range value for date
CONTEXT:  referenced column: date
 date 
------
 
(1 row)

SELECT 101::date;
    date    
------------
 2000-01-01
(1 row)

SELECT 10228::date;
    date    
------------
 2001-02-28
(1 row)

SELECT 10229::date;
WARNING:  Out of range value for date
CONTEXT:  referenced column: date
 date 
------
 
(1 row)

SELECT 991231::date;
    date    
------------
 1999-12-31
(1 row)

SELECT 99991231::date;
    date    
------------
 9999-12-31
(1 row)

SELECT 21000228::date;
    date    
------------
 2100-02-28
(1 row)

SELECT 21000229::date;
WARNING:  Out of range value for date
CONTEXT:  referenced column: date
 date 
------
 
(1 row)

SELECT 100000000::date;
WARNING:  Out of range value for date
CONTEXT:  referenced column: date
 date 
------
 
(1 row)

SELECT 100101231::date;
WARNING:  Out of range value for date
CONTEXT:  referenced column: date
 date 
------
 
(1 row)

-- test time
-- '[-][D] hh:mm:ss.fsec'
SELECT time(7)'12:12:12.123456';
WARNING:  TIME(7) precision reduced to maximum allowed, 6
LINE 1: SELECT time(7)'12:12:12.123456';
               ^
CONTEXT:  referenced column: time
      time       
-----------------
 12:12:12.123456
(1 row)

SELECT time(6)'12:12:12.123456';
      time       
-----------------
 12:12:12.123456
(1 row)

SELECT time(5)'12:12:12.123456';
      time      
----------------
 12:12:12.12346
(1 row)

SELECT time(4)'12:12:12.123456';
     time      
---------------
 12:12:12.1235
(1 row)

SELECT time(3)'12:12:12.123456';
     time     
--------------
 12:12:12.123
(1 row)

SELECT time(2)'12:12:12.123456';
    time     
-------------
 12:12:12.12
(1 row)

SELECT time(1)'12:12:12.123456';
    time    
------------
 12:12:12.1
(1 row)

SELECT time(0)'12:12:12.123456';
   time   
----------
 12:12:12
(1 row)

SELECT time'12:12:12.123456';
      time       
-----------------
 12:12:12.123456
(1 row)

SELECT time'34 22:59:59.999999';
ERROR:  date/time field value out of range: "34 22:59:59.999999"
CONTEXT:  referenced column: time
SELECT time'12:60:12.123456';
ERROR:  date/time field value out of range: "12:60:12.123456"
CONTEXT:  referenced column: time
SELECT time'12:12:60.123456';
ERROR:  date/time field value out of range: "12:12:60.123456"
CONTEXT:  referenced column: time
SELECT time'34 23:00:00';
ERROR:  date/time field value out of range: "34 23:00:00"
CONTEXT:  referenced column: time
SELECT time'-34 23:00:00';
ERROR:  date/time field value out of range: "-34 23:00:00"
CONTEXT:  referenced column: time
SELECT time'34 22:59:59';
   time    
-----------
 838:59:59
(1 row)

SELECT time'-34 22:59:59';
    time    
------------
 -838:59:59
(1 row)

SELECT time'34 22:59:59.999999';
ERROR:  date/time field value out of range: "34 22:59:59.999999"
CONTEXT:  referenced column: time
SELECT time'34 22:59:59.9999999999999999999999';
ERROR:  date/time field value out of range: "34 22:59:59.9999999999999999999999"
CONTEXT:  referenced column: time
SELECT time'-34 22:59:59.9999999999999999999999';
ERROR:  date/time field value out of range: "-34 22:59:59.9999999999999999999999"
CONTEXT:  referenced column: time
SELECT time'-34 22:59:59.9999999999999999999999';
ERROR:  date/time field value out of range: "-34 22:59:59.9999999999999999999999"
CONTEXT:  referenced column: time
SELECT time'838:59:59';
   time    
-----------
 838:59:59
(1 row)

SELECT time'839:00:00';
ERROR:  date/time field value out of range: "839:00:00"
CONTEXT:  referenced column: time
SELECT time'59:59';
   time   
----------
 59:59:00
(1 row)

SELECT time'59:59.123';
     time     
--------------
 59:59:00.123
(1 row)

SELECT time'59';
   time   
----------
 00:00:59
(1 row)

SELECT time'24 24';
   time    
-----------
 600:00:00
(1 row)

SELECT time'24 12:13';
   time    
-----------
 588:13:00
(1 row)

SELECT time'59.12';
    time     
-------------
 00:00:59.12
(1 row)

SELECT time'';
   time   
----------
 00:00:00
(1 row)

SELECT time'1 09';
   time   
----------
 33:00:00
(1 row)

SELECT time'0 099';
   time   
----------
 99:00:00
(1 row)

SELECT time'-2 00000009';
   time    
-----------
 -57:00:00
(1 row)

-- 'hhmmss.fsec'
SELECT time(1)'1.123456';
    time    
------------
 00:00:01.1
(1 row)

SELECT time(2)'12.123456';
    time     
-------------
 00:00:12.12
(1 row)

SELECT time(3)'123.123456';
     time     
--------------
 00:01:23.123
(1 row)

SELECT time(4)'1234.123456';
     time      
---------------
 00:12:34.1235
(1 row)

SELECT time(5)'12345.123456';
      time      
----------------
 01:23:45.12346
(1 row)

SELECT time'123456.123456';
      time       
-----------------
 12:34:56.123456
(1 row)

-- hhmmss.fsec
SELECT 2::time;
   time   
----------
 00:00:02
(1 row)

SELECT 20::time;
   time   
----------
 00:00:20
(1 row)

SELECT 201::time;
   time   
----------
 00:02:01
(1 row)

SELECT 2011::time;
   time   
----------
 00:20:11
(1 row)

SELECT 2115.12::time;
   time   
----------
 00:21:15
(1 row)

SELECT 20115.23::time;
   time   
----------
 02:01:15
(1 row)

SELECT 233445.123::time;
   time   
----------
 23:34:45
(1 row)

SELECT 233445.123::time;
   time   
----------
 23:34:45
(1 row)

SELECT 8385959.999999::time;
WARNING:  invalid input syntax for type time: "8385959.999999"
CONTEXT:  referenced column: time
   time    
-----------
 839:00:00
(1 row)

SELECT 8385959.9999999::time;
WARNING:  invalid input syntax for type time: "8385959.9999999"
CONTEXT:  referenced column: time
   time    
-----------
 839:00:00
(1 row)

SELECT -232323::time;
 ?column?  
-----------
 -23:23:23
(1 row)

SELECT -8385959::time;
  ?column?  
------------
 -838:59:59
(1 row)

CREATE TABLE time_tbl (v time);
INSERT INTO time_tbl VALUES(-561234);
INSERT INTO time_tbl VALUES(-1202334);
INSERT INTO time_tbl VALUES(99991231235959);
INSERT INTO time_tbl VALUES(99991231235959.999999);
INSERT INTO time_tbl VALUES('20220-01-01');
ERROR:  invalid input syntax for type time: "20220-01-01"
LINE 1: INSERT INTO time_tbl VALUES('20220-01-01');
                                    ^
CONTEXT:  referenced column: v
-- test table's dafault typmod
INSERT INTO time_tbl VALUES(232323.123);
SELECT * FROM time_tbl;
     v      
------------
 -56:12:34
 -120:23:34
 23:59:59
 24:00:00
 23:23:23
(5 rows)

-- test alter table add [column]
ALTER TABLE time_tbl ADD COLUMN dt datetime;
ALTER TABLE time_tbl ADD ts timestamp;
INSERT INTO time_tbl VALUES(232323.555, 20201212101010.555, 20201212101010.555);
SELECT * FROM time_tbl;
     v      |         dt          |           ts           
------------+---------------------+------------------------
 -56:12:34  |                     | 
 -120:23:34 |                     | 
 23:59:59   |                     | 
 24:00:00   |                     | 
 23:23:23   |                     | 
 23:23:24   | 2020-12-12 10:10:11 | 2020-12-12 10:10:11-08
(6 rows)

DROP TABLE time_tbl;
-- test alter table modify column
CREATE TABLE time_tbl (v time(2));
INSERT INTO time_tbl VALUES(232323.555);
SELECT * FROM time_tbl;
      v      
-------------
 23:23:23.56
(1 row)

ALTER TABLE time_tbl MODIFY v time;
SELECT * FROM time_tbl;
    v     
----------
 23:23:24
(1 row)

DROP TABLE time_tbl;
-- test function
SELECT time '830:12:34' + interval '3 hours';
 ?column?  
-----------
 833:12:34
(1 row)

SELECT time '830:12:34' + interval '3 minutes';
 ?column?  
-----------
 830:15:34
(1 row)

SELECT time '830:12:34' + interval '3 seconds';
 ?column?  
-----------
 830:12:37
(1 row)

SELECT time '830:12:34' + interval '26 seconds';
 ?column?  
-----------
 830:13:00
(1 row)

SELECT time '830:12:34' - interval '3 hours';
 ?column?  
-----------
 827:12:34
(1 row)

SELECT time '837:00:00' + interval '2 hours';
ERROR:  time out of range
SELECT time '838:59:59' + interval '1 second';
ERROR:  time out of range
SELECT time '-837:00:00' - interval '3 hours';
ERROR:  time out of range
SELECT time '1:00:00' - interval '3 hours';
 ?column?  
-----------
 -02:00:00
(1 row)

-- test datetime
-- 'YYYY-MM-DD hh:mm:ss.fsec' or 'YY-MM-DD hh:mm:ss.fsec'
SELECT datetime(2)'2001-01-01  23:59:59.999999';
      timestamp      
---------------------
 2001-01-02 00:00:00
(1 row)

SELECT datetime(3)'2001-01-01  23:59:59.9999999';
      timestamp      
---------------------
 2001-01-02 00:00:00
(1 row)

SELECT datetime(4)'9999-12-31  23:59:59.9999999';
      timestamp       
----------------------
 10000-01-01 00:00:00
(1 row)

SELECT datetime(5)'999-12-31  23:59:59.9999999';
      timestamp      
---------------------
 1000-01-01 00:00:00
(1 row)

SELECT datetime'99-01-01  23:59:59.123';
        timestamp        
-------------------------
 1999-01-01 23:59:59.123
(1 row)

SELECT datetime'2001-2-28  23:59:59.123';
        timestamp        
-------------------------
 2001-02-28 23:59:59.123
(1 row)

SELECT datetime'2000-2-28  23:59:59.123';
        timestamp        
-------------------------
 2000-02-28 23:59:59.123
(1 row)

SELECT datetime'2000-2-28  12:23:34.5678';
        timestamp         
--------------------------
 2000-02-28 12:23:34.5678
(1 row)

-- 'YYYYMMDDhhmmss.fsec' or 'YYMMDDhhmmss.fsec'
SELECT datetime(1)'20010101010101.1278';
       timestamp       
-----------------------
 2001-01-01 01:01:01.1
(1 row)

SELECT datetime(1)'010101010101.1234';
       timestamp       
-----------------------
 2001-01-01 01:01:01.1
(1 row)

SELECT datetime(2)'0101010101';
      timestamp      
---------------------
 2001-01-01 01:01:00
(1 row)

SELECT datetime(1)'01010101';
      timestamp      
---------------------
 0101-01-01 00:00:00
(1 row)

SELECT datetime(3)'0101017';
      timestamp      
---------------------
 2001-01-01 07:00:00
(1 row)

SELECT datetime(1)'010101';
      timestamp      
---------------------
 2001-01-01 00:00:00
(1 row)

SELECT datetime(1)'10101';
      timestamp      
---------------------
 2010-10-01 00:00:00
(1 row)

SELECT datetime(1)'71101';
      timestamp      
---------------------
 1971-10-01 00:00:00
(1 row)

SELECT datetime(1)'0101';
WARNING:  invalid input syntax for type timestamp: "0101"
LINE 1: SELECT datetime(1)'0101';
                          ^
CONTEXT:  referenced column: timestamp
      timestamp      
---------------------
 0000-00-00 00:00:00
(1 row)

-- YYYYMMDDhhmmss or YYMMDDhhmmss
SELECT 11::datetime;
WARNING:  timestamp out of range
CONTEXT:  referenced column: timestamp
 timestamp 
-----------
 
(1 row)

SELECT 111::datetime;
      timestamp      
---------------------
 2000-01-11 00:00:00
(1 row)

SELECT 1111::datetime;
      timestamp      
---------------------
 2000-11-11 00:00:00
(1 row)

SELECT 11111::datetime;
      timestamp      
---------------------
 2001-11-11 00:00:00
(1 row)

SELECT 111111::datetime;
      timestamp      
---------------------
 2011-11-11 00:00:00
(1 row)

SELECT 1111111::datetime;
      timestamp      
---------------------
 0111-11-11 00:00:00
(1 row)

SELECT 11111111::datetime;
      timestamp      
---------------------
 1111-11-11 00:00:00
(1 row)

SELECT 111111111::datetime;
      timestamp      
---------------------
 2000-01-11 11:11:11
(1 row)

SELECT 1111111111::datetime;
      timestamp      
---------------------
 2000-11-11 11:11:11
(1 row)

SELECT 11111111111::datetime;
      timestamp      
---------------------
 2001-11-11 11:11:11
(1 row)

SELECT 111111111111::datetime;
      timestamp      
---------------------
 2011-11-11 11:11:11
(1 row)

SELECT 1111111111111::datetime;
      timestamp      
---------------------
 0111-11-11 11:11:11
(1 row)

SELECT 11111111111111::datetime;
      timestamp      
---------------------
 1111-11-11 11:11:11
(1 row)

-- test datetime operation
create table test_dt(dt datetime);
insert into test_dt values('1997-11-10');
insert into test_dt values('2000-11-10');
insert into test_dt values('1997-11-10');
insert into test_dt values('2012-11-10');
insert into test_dt values('2008-11-10');
insert into test_dt values('1994-11-10');
select max(dt) from test_dt;
         max         
---------------------
 2012-11-10 00:00:00
(1 row)

select min(dt) from test_dt;
         min         
---------------------
 1994-11-10 00:00:00
(1 row)

select distinct(dt) from test_dt;
         dt          
---------------------
 2000-11-10 00:00:00
 2008-11-10 00:00:00
 1994-11-10 00:00:00
 1997-11-10 00:00:00
 2012-11-10 00:00:00
(5 rows)

select * from test_dt;
         dt          
---------------------
 1997-11-10 00:00:00
 2000-11-10 00:00:00
 1997-11-10 00:00:00
 2012-11-10 00:00:00
 2008-11-10 00:00:00
 1994-11-10 00:00:00
(6 rows)

create index on test_dt(dt);
select * from test_dt where dt > '2007-01-01';
         dt          
---------------------
 2012-11-10 00:00:00
 2008-11-10 00:00:00
(2 rows)

select * from test_dt where dt = '1997-11-10';
         dt          
---------------------
 1997-11-10 00:00:00
 1997-11-10 00:00:00
(2 rows)

select * from test_dt where dt < '1997-11-10';
         dt          
---------------------
 1994-11-10 00:00:00
(1 row)

-- test now() and current_timestamp
create table test_datetime(c1 datetime);
insert into test_datetime values(now());
insert into test_datetime values(current_timestamp);
drop table test_datetime;
-- test timestamp with[out] timezone
select timestamp with time zone'1994-11-10 23:12:34.5678';
         timestamptz         
-----------------------------
 1994-11-10 23:12:34.5678-08
(1 row)

select timestamp without time zone'1994-11-10 23:12:34.5678';
        timestamp         
--------------------------
 1994-11-10 23:12:34.5678
(1 row)

select timestamp'1994-11-10 23:12:34.5678';
        timestamp         
--------------------------
 1994-11-10 23:12:34.5678
(1 row)

-- test timestamp
set time zone 'PRC';
CREATE TABLE timestamp_tbl (v timestamp(2));
-- 'YYYY-MM-DD hh:mm:ss.fsec' or 'YY-MM-DD hh:mm:ss.fsec'
INSERT INTO timestamp_tbl VALUES ('2001-01-01  23:59:59.999999');
INSERT INTO timestamp_tbl VALUES ('2001-01-01  23:59:59.9999999');
INSERT INTO timestamp_tbl VALUES ('9999-12-31  23:59:59.9999999');
INSERT INTO timestamp_tbl VALUES ('999-12-31  23:59:59.9999999');
INSERT INTO timestamp_tbl VALUES ('99-01-01  23:59:59.123');
INSERT INTO timestamp_tbl VALUES ('2001-2-28  23:59:59.123');
INSERT INTO timestamp_tbl VALUES ('2000-2-28  23:59:59.123');
-- 'YYYYMMDDhhmmss.fsec' or 'YYMMDDhhmmss.fsec'
INSERT INTO timestamp_tbl VALUES ('20010101010101.1278');
INSERT INTO timestamp_tbl VALUES ('010101010101.1234');
INSERT INTO timestamp_tbl VALUES ('0101010101');
INSERT INTO timestamp_tbl VALUES ('01010101');
INSERT INTO timestamp_tbl VALUES ('0101017');
INSERT INTO timestamp_tbl VALUES ('010101');
INSERT INTO timestamp_tbl VALUES ('0101');
ERROR:  invalid input syntax for type timestamp: "0101"
LINE 1: INSERT INTO timestamp_tbl VALUES ('0101');
                                          ^
CONTEXT:  referenced column: v
-- YYYYMMDDhhmmss or YYMMDDhhmmss
INSERT INTO timestamp_tbl VALUES (11);
ERROR:  timestamp out of range
CONTEXT:  referenced column: v
INSERT INTO timestamp_tbl VALUES (111);
INSERT INTO timestamp_tbl VALUES (1111);
INSERT INTO timestamp_tbl VALUES (11111);
INSERT INTO timestamp_tbl VALUES (111111);
INSERT INTO timestamp_tbl VALUES (1111111);
INSERT INTO timestamp_tbl VALUES (11111111);
INSERT INTO timestamp_tbl VALUES (111111111);
INSERT INTO timestamp_tbl VALUES (1111111111);
INSERT INTO timestamp_tbl VALUES (11111111111);
INSERT INTO timestamp_tbl VALUES (111111111111);
INSERT INTO timestamp_tbl VALUES (1111111111111);
INSERT INTO timestamp_tbl VALUES (11111111111111);
SELECT * FROM timestamp_tbl;
              v               
------------------------------
 2001-01-02 00:00:00+08
 2001-01-02 00:00:00+08
 10000-01-01 00:00:00+08
 1000-01-01 00:00:00+08:05:43
 1999-01-01 23:59:59.12+08
 2001-02-28 23:59:59.12+08
 2000-02-28 23:59:59.12+08
 2001-01-01 01:01:01.13+08
 2001-01-01 01:01:01.12+08
 2001-01-01 01:01:00+08
 0101-01-01 00:00:00+08:05:43
 2001-01-01 07:00:00+08
 2001-01-01 00:00:00+08
 2000-01-11 00:00:00+08
 2000-11-11 00:00:00+08
 2001-11-11 00:00:00+08
 2011-11-11 00:00:00+08
 0111-11-11 00:00:00+08:05:43
 1111-11-11 00:00:00+08:05:43
 2000-01-11 11:11:11+08
 2000-11-11 11:11:11+08
 2001-11-11 11:11:11+08
 2011-11-11 11:11:11+08
 0111-11-11 11:11:11+08:05:43
 1111-11-11 11:11:11+08:05:43
(25 rows)

set time zone 'UTC';
SELECT * FROM timestamp_tbl;
             v             
---------------------------
 2001-01-01 16:00:00+00
 2001-01-01 16:00:00+00
 9999-12-31 16:00:00+00
 0999-12-31 15:54:17+00
 1999-01-01 15:59:59.12+00
 2001-02-28 15:59:59.12+00
 2000-02-28 15:59:59.12+00
 2000-12-31 17:01:01.13+00
 2000-12-31 17:01:01.12+00
 2000-12-31 17:01:00+00
 0100-12-31 15:54:17+00
 2000-12-31 23:00:00+00
 2000-12-31 16:00:00+00
 2000-01-10 16:00:00+00
 2000-11-10 16:00:00+00
 2001-11-10 16:00:00+00
 2011-11-10 16:00:00+00
 0111-11-10 15:54:17+00
 1111-11-10 15:54:17+00
 2000-01-11 03:11:11+00
 2000-11-11 03:11:11+00
 2001-11-11 03:11:11+00
 2011-11-11 03:11:11+00
 0111-11-11 03:05:28+00
 1111-11-11 03:05:28+00
(25 rows)

set time zone 'PRC';
DROP TABLE timestamp_tbl;
-- test YEAR
DROP TABLE IF EXISTS year_tbl;
NOTICE:  table "year_tbl" does not exist, skipping
-- test invalid display width
CREATE TABLE year_tbl (y YEAR(-1));
ERROR:  invalid display width and use YEAR instead
CREATE TABLE year_tbl (y YEAR(0));
ERROR:  invalid display width and use YEAR instead
CREATE TABLE year_tbl (y YEAR(1));
ERROR:  invalid display width and use YEAR instead
CREATE TABLE year_tbl (y YEAR(3));
ERROR:  invalid display width and use YEAR instead
CREATE TABLE year_tbl (y YEAR(5));
ERROR:  invalid display width and use YEAR instead
CREATE TABLE year_tbl (y YEAR(4294967297));
ERROR:  value "4294967297" is out of range for type integer
-- test YEAR YEAR(2) YEAR(4)
CREATE TABLE year_tbl (y YEAR, y4 YEAR(4), y2 YEAR(2));
INSERT INTO year_tbl VALUES (1900, 1900, 1900);
ERROR:  Out of range value for year data type!
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES ('1900', '1900', '1900');
ERROR:  Out of range value for year data type!
LINE 1: INSERT INTO year_tbl VALUES ('1900', '1900', '1900');
                                     ^
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES (2156, 2156, 2156);
ERROR:  Out of range value for year data type!
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES ('2156', '2156', '2156');
ERROR:  Out of range value for year data type!
LINE 1: INSERT INTO year_tbl VALUES ('2156', '2156', '2156');
                                     ^
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES (1901, 1901, 1901);
INSERT INTO year_tbl VALUES ('1901', '1901', '1901');
INSERT INTO year_tbl VALUES (2155, 2155, 2155);
INSERT INTO year_tbl VALUES ('2155', '2155', '2155');
INSERT INTO year_tbl VALUES (70, 70, 70);
INSERT INTO year_tbl VALUES ('70', '70', '70');
INSERT INTO year_tbl VALUES (69, 69, 69);
INSERT INTO year_tbl VALUES ('69', '69', '69');
INSERT INTO year_tbl VALUES (2156, 2156, 2156);
ERROR:  Out of range value for year data type!
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES ('2156', '2156', '2156');
ERROR:  Out of range value for year data type!
LINE 1: INSERT INTO year_tbl VALUES ('2156', '2156', '2156');
                                     ^
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES (-1, -1, -1);
ERROR:  Out of range value for year data type!
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES ('-1', '-1', '-1');
ERROR:  Out of range value for year data type!
LINE 1: INSERT INTO year_tbl VALUES ('-1', '-1', '-1');
                                     ^
CONTEXT:  referenced column: y
INSERT INTO year_tbl VALUES (0, 0, 0);
INSERT INTO year_tbl VALUES ('0', '0', '0');
INSERT INTO year_tbl VALUES ('00', '00', '00');
INSERT INTO year_tbl VALUES ('000', '000', '000');
INSERT INTO year_tbl VALUES ('0000', '0000', '0000');
INSERT INTO year_tbl VALUES (1, 1, 1);
INSERT INTO year_tbl VALUES ('1', '1', '1');
SELECT * FROM year_tbl;
  y   |  y4  | y2 
------+------+----
 1901 | 1901 | 01
 1901 | 1901 | 01
 2155 | 2155 | 55
 2155 | 2155 | 55
 1970 | 1970 | 70
 1970 | 1970 | 70
 2069 | 2069 | 69
 2069 | 2069 | 69
 0    | 0    | 0
 2000 | 2000 | 00
 2000 | 2000 | 00
 2000 | 2000 | 00
 0    | 0    | 0
 2001 | 2001 | 01
 2001 | 2001 | 01
(15 rows)

-- test order by
SELECT * FROM year_tbl ORDER BY y ASC;
  y   |  y4  | y2 
------+------+----
 0    | 0    | 0
 0    | 0    | 0
 1901 | 1901 | 01
 1901 | 1901 | 01
 1970 | 1970 | 70
 1970 | 1970 | 70
 2000 | 2000 | 00
 2000 | 2000 | 00
 2000 | 2000 | 00
 2001 | 2001 | 01
 2001 | 2001 | 01
 2069 | 2069 | 69
 2069 | 2069 | 69
 2155 | 2155 | 55
 2155 | 2155 | 55
(15 rows)

-- test max, min, distinct
SELECT max(y), min(y4) FROM year_tbl;
 max  | min 
------+-----
 2155 | 0
(1 row)

SELECT distinct(y) FROM year_tbl;
  y   
------
 0
 1901
 1970
 2000
 2001
 2069
 2155
(7 rows)

-- test index
CREATE INDEX test_b_tree_idx ON year_tbl(y);
DROP INDEX test_b_tree_idx;
DROP TABLE year_tbl;
-- test operation of YEAR and YEAR(2)
SELECT ('2010')::YEAR(2)<(2001)::YEAR;
 ?column? 
----------
 f
(1 row)

SELECT ('2010')::YEAR(2)>(2001)::YEAR;
 ?column? 
----------
 t
(1 row)

SELECT ('2010')::YEAR(2)>(2001);
 ?column? 
----------
 t
(1 row)

SELECT (2010)>(2001)::YEAR;
 ?column? 
----------
 t
(1 row)

SELECT (2001)=(2001)::YEAR;
 ?column? 
----------
 t
(1 row)

SELECT (2001)=(2001)::YEAR(2);
 ?column? 
----------
 t
(1 row)

-- test operation of year and YEAR(2)
SELECT (2010)::YEAR-(2001)::YEAR;
 ?column?  
-----------
 @ 9 years
(1 row)

SELECT (2010)::YEAR-(2111)::YEAR;
    ?column?     
-----------------
 @ 101 years ago
(1 row)

SELECT (2010)::YEAR-(2111)::YEAR;
    ?column?     
-----------------
 @ 101 years ago
(1 row)

SELECT (2010)::YEAR-(interval '2' year);
 ?column? 
----------
 2008
(1 row)

SELECT (2010)::YEAR+(interval '2' year);
 ?column? 
----------
 2012
(1 row)

SELECT (1970)::YEAR-(interval '69' year);
 ?column? 
----------
 1901
(1 row)

SELECT (1970)::YEAR-(interval '70' year);
ERROR:  Out of range value for year data type!
SELECT (2069)::YEAR+(interval '86' year);
 ?column? 
----------
 2155
(1 row)

SELECT (2069)::YEAR+(interval '87' year);
ERROR:  Out of range value for year data type!
SELECT (2069)::YEAR+(interval'366day');
 ?column? 
----------
 2070
(1 row)

SELECT (2010)::YEAR(2)-(2001)::YEAR(2);
 ?column?  
-----------
 @ 9 years
(1 row)

SELECT (2010)::YEAR(2)-(2111)::YEAR;
    ?column?     
-----------------
 @ 101 years ago
(1 row)

SELECT (2010)::YEAR-(2111)::YEAR(2);
    ?column?     
-----------------
 @ 101 years ago
(1 row)

SELECT (2010)::YEAR(2)-(interval '2' year);
 ?column? 
----------
 08
(1 row)

SELECT (2010)::YEAR(2)+(interval '2' year);
 ?column? 
----------
 12
(1 row)

SELECT (1970)::YEAR(2)-(interval '69' year);
 ?column? 
----------
 01
(1 row)

SELECT (1970)::YEAR(2)-(interval '70' year);
ERROR:  Out of range value for year data type!
SELECT (2069)::YEAR(2)+(interval '86' year);
 ?column? 
----------
 55
(1 row)

SELECT (2069)::YEAR(2)+(interval '87' year);
ERROR:  Out of range value for year data type!
SELECT (2069)::YEAR(2)+(interval'366day');
 ?column? 
----------
 70
(1 row)

-- test year +/- integer
create table t_year0035(ts1 year(4) ,ts2 integer);
insert into t_year0035 values('1904','1');
insert into t_year0035 values('1902','2');
insert into t_year0035 values('1907','5');
select ts1 + ts2 from t_year0035;
 ?column? 
----------
     1905
     1904
     1912
(3 rows)

select ts2 + ts1 from t_year0035;
 ?column? 
----------
     1905
     1904
     1912
(3 rows)

select ts1 - ts2 from t_year0035;
 ?column? 
----------
     1903
     1900
     1902
(3 rows)

select ts2 - ts1 from t_year0035;
 ?column? 
----------
    -1903
    -1900
    -1902
(3 rows)

drop table t_year0035;
-- test overflow
select integer'2147481650' + year'1998';
ERROR:  integer out of range
select year'1998' + integer'2147481650';
ERROR:  integer out of range
select integer'-2147481651' - year'1997';
  ?column?   
-------------
 -2147483648
(1 row)

-- test year input
select year '20$#12';
WARNING:  invalid input syntax for type double precision: "20$#12"
LINE 1: select year '20$#12';
                    ^
CONTEXT:  referenced column: year
 year 
------
 2020
(1 row)

select year '20中文12';
WARNING:  invalid input syntax for type double precision: "20中文12"
LINE 1: select year '20中文12';
                    ^
CONTEXT:  referenced column: year
 year 
------
 2020
(1 row)

select year '    1997    ';
 year 
------
 1997
(1 row)

select year '  1997';
 year 
------
 1997
(1 row)

select year '1997  ';
 year 
------
 1997
(1 row)

select year ' 1997  89';
WARNING:  invalid input syntax for type double precision: " 1997  89"
LINE 1: select year ' 1997  89';
                    ^
CONTEXT:  referenced column: year
 year 
------
 1997
(1 row)

select year ' 1997  #@#';
WARNING:  invalid input syntax for type double precision: " 1997  #@#"
LINE 1: select year ' 1997  #@#';
                    ^
CONTEXT:  referenced column: year
 year 
------
 1997
(1 row)

select year '&%2122';
WARNING:  invalid input syntax for type double precision: "&%2122"
LINE 1: select year '&%2122';
                    ^
CONTEXT:  referenced column: year
 year 
------
 0
(1 row)

select year '中文2122';
WARNING:  invalid input syntax for type double precision: "中文2122"
LINE 1: select year '中文2122';
                    ^
CONTEXT:  referenced column: year
 year 
------
 0
(1 row)

select year '98.3';
 year 
------
 1998
(1 row)

select year '98.5';
 year 
------
 1999
(1 row)

select year '00001';
 year 
------
 2001
(1 row)

select year '-0.2';
 year 
------
 0
(1 row)

select year '-000';
 year 
------
 0
(1 row)

select year '';
WARNING:  invalid input syntax for type double precision: ""
LINE 1: select year '';
                    ^
CONTEXT:  referenced column: year
 year 
------
 0
(1 row)

select year ' ';
WARNING:  invalid input syntax for type double precision: " "
LINE 1: select year ' ';
                    ^
CONTEXT:  referenced column: year
 year 
------
 0
(1 row)

select year 'abcd';
WARNING:  invalid input syntax for type double precision: "abcd"
LINE 1: select year 'abcd';
                    ^
CONTEXT:  referenced column: year
 year 
------
 0
(1 row)

select year '001a';
WARNING:  invalid input syntax for type double precision: "001a"
LINE 1: select year '001a';
                    ^
CONTEXT:  referenced column: year
 year 
------
 2001
(1 row)

select year 'a001';
WARNING:  invalid input syntax for type double precision: "a001"
LINE 1: select year 'a001';
                    ^
CONTEXT:  referenced column: year
 year 
------
 0
(1 row)

select year 'a000';
WARNING:  invalid input syntax for type double precision: "a000"
LINE 1: select year 'a000';
                    ^
CONTEXT:  referenced column: year
 year 
------
 0
(1 row)

select year '000a';
WARNING:  invalid input syntax for type double precision: "000a"
LINE 1: select year '000a';
                    ^
CONTEXT:  referenced column: year
 year 
------
 0
(1 row)

select ''::longblob::year;
WARNING:  invalid input syntax for type bigint: ""
CONTEXT:  referenced column: year
SQL function "text_year" statement 1
referenced column: year
SQL function "varlena2year" statement 1
referenced column: year
 year 
------
 0
(1 row)

-- test partition key
CREATE TABLESPACE b_time_type_example RELATIVE LOCATION 'tablespace1/tablespace_1';
-- year range key
CREATE TABLE y_range
(
    y year
)
TABLESPACE b_time_type_example
PARTITION BY RANGE(y)
(
    PARTITION P1 VALUES LESS THAN(2000),
    PARTITION P2 VALUES LESS THAN(2050)
)
ENABLE ROW MOVEMENT;
INSERT INTO y_range VALUES(1997);
INSERT INTO y_range VALUES(2030);
INSERT INTO y_range VALUES(2060);
ERROR:  inserted partition key does not map to any table partition
SELECT * FROM y_range;
  y   
------
 1997
 2030
(2 rows)

SELECT * FROM y_range PARTITION(P1);
  y   
------
 1997
(1 row)

SELECT * FROM y_range PARTITION(P2);
  y   
------
 2030
(1 row)

DROP TABLE y_range;
-- time range key
CREATE TABLE ti_range
(
    t time
)
TABLESPACE b_time_type_example
PARTITION BY RANGE(t)
(
        PARTITION P1 VALUES LESS THAN('-12:00:00'),
        PARTITION P2 VALUES LESS THAN('48:00:00')
)
ENABLE ROW MOVEMENT;
INSERT INTO ti_range VALUES('-20:00:00');
INSERT INTO ti_range VALUES('20:00:00');
INSERT INTO ti_range VALUES('120:00:00');
ERROR:  inserted partition key does not map to any table partition
SELECT * FROM ti_range;
     t     
-----------
 -20:00:00
 20:00:00
(2 rows)

SELECT * FROM ti_range PARTITION(P1);
     t     
-----------
 -20:00:00
(1 row)

SELECT * FROM ti_range PARTITION(P2);
    t     
----------
 20:00:00
(1 row)

DROP TABLE ti_range;
-- year list key
CREATE TABLE y_list
(
    y year
)
TABLESPACE b_time_type_example
PARTITION BY LIST(y)
(
    PARTITION P1 VALUES IN(1991, 1997, 2000),
    PARTITION P2 VALUES IN(1992, 1998, 2010)
)
ENABLE ROW MOVEMENT;
INSERT INTO y_list VALUES(1991);
INSERT INTO y_list VALUES(1997);
INSERT INTO y_list VALUES(2000);
INSERT INTO y_list VALUES(1992);
INSERT INTO y_list VALUES(1998);
INSERT INTO y_list VALUES(2010);
INSERT INTO y_list VALUES(2011);
ERROR:  inserted partition key does not map to any table partition
INSERT INTO y_list VALUES(1990);
ERROR:  inserted partition key does not map to any table partition
SELECT * FROM y_list ORDER BY y;
  y   
------
 1991
 1992
 1997
 1998
 2000
 2010
(6 rows)

SELECT * FROM y_list PARTITION(P1);
  y   
------
 1991
 1997
 2000
(3 rows)

SELECT * FROM y_list PARTITION(P2);
  y   
------
 1992
 1998
 2010
(3 rows)

DROP TABLE y_list;
-- time list key
CREATE TABLE ti_list
(
    t time
)
TABLESPACE b_time_type_example
PARTITION BY LIST(t)
(
        PARTITION P1 VALUES IN('12:00:00', '60000', '-3:0:0'),
        PARTITION P2 VALUES IN('2:0:0', '-5:0:0')
)
ENABLE ROW MOVEMENT;
INSERT INTO ti_list VALUES('12:00:00');
INSERT INTO ti_list VALUES('02:00:00');
INSERT INTO ti_list VALUES('6:00:00');
INSERT INTO ti_list VALUES('-30000');
INSERT INTO ti_list VALUES('-50000');
INSERT INTO ti_list VALUES('3:12:12');
ERROR:  inserted partition key does not map to any table partition
SELECT * FROM ti_list;
     t     
-----------
 02:00:00
 -05:00:00
 12:00:00
 06:00:00
 -03:00:00
(5 rows)

SELECT * FROM ti_list PARTITION(P1);
     t     
-----------
 12:00:00
 06:00:00
 -03:00:00
(3 rows)

SELECT * FROM ti_list PARTITION(P2);
     t     
-----------
 02:00:00
 -05:00:00
(2 rows)

DROP TABLE ti_list;
-- year hash key
CREATE TABLE y_hash
(
    y year
)
TABLESPACE b_time_type_example
PARTITION BY HASH(y)
(
    PARTITION P1,
    PARTITION P2,
    PARTITION P3,
    PARTITION P4
);
INSERT INTO y_hash VALUES(1991);
INSERT INTO y_hash VALUES(2010);
INSERT INTO y_hash VALUES(2054);
INSERT INTO y_hash VALUES(2056);
INSERT INTO y_hash VALUES(2000);
INSERT INTO y_hash VALUES(1992);
INSERT INTO y_hash VALUES(1998);
INSERT INTO y_hash VALUES(1970);
INSERT INTO y_hash VALUES(1980);
INSERT INTO y_hash VALUES(2133);
INSERT INTO y_hash VALUES(2100);
INSERT INTO y_hash VALUES(2122);
SELECT * FROM y_hash order by 1;
  y   
------
 1970
 1980
 1991
 1992
 1998
 2000
 2010
 2054
 2056
 2100
 2122
 2133
(12 rows)

SELECT * FROM y_hash PARTITION(P1);
  y   
------
 1991
 2010
 1992
(3 rows)

SELECT * FROM y_hash PARTITION(P2);
  y   
------
 1980
 2100
(2 rows)

SELECT * FROM y_hash PARTITION(P3);
  y   
------
 2054
 2056
 2000
 1998
(4 rows)

SELECT * FROM y_hash PARTITION(P4);
  y   
------
 1970
 2133
 2122
(3 rows)

DROP TABLE y_hash;
-- time hash key
CREATE TABLE ti_hash
(
    ti time
)
TABLESPACE b_time_type_example
PARTITION BY HASH(ti)
(
    PARTITION P1,
    PARTITION P2
);
INSERT INTO ti_hash VALUES('12:1:1');
INSERT INTO ti_hash VALUES('12:1:2');
INSERT INTO ti_hash VALUES('12:1:3');
INSERT INTO ti_hash VALUES('12:1:4');
INSERT INTO ti_hash VALUES('12:1:5');
SELECT * FROM ti_hash order by 1;
    ti    
----------
 12:01:01
 12:01:02
 12:01:03
 12:01:04
 12:01:05
(5 rows)

SELECT * FROM ti_hash PARTITION(P1);
    ti    
----------
 12:01:02
(1 row)

SELECT * FROM ti_hash PARTITION(P2);
    ti    
----------
 12:01:01
 12:01:03
 12:01:04
 12:01:05
(4 rows)

DROP TABLE ti_hash;
-- test cast function
SELECT cast(-232323.555 as time);
   time    
-----------
 -23:23:24
(1 row)

SELECT cast('20121010101010.555' as datetime);
      timestamp      
---------------------
 2012-10-10 10:10:11
(1 row)

select cast(('2001-10-10 11:11:59.123456'::time(6)) as int);
  int4  
--------
 111159
(1 row)

select cast(('2001-10-10 11:11:59.123456'::date) as int);
   int4   
----------
 20011010
(1 row)

select cast(('2001-10-10 11:11:59.123456'::datetime(6)) as bigint);
      int8      
----------------
 20011010111159
(1 row)

-- test time type operations
select ('2001-10-10 11:11:59.123456'::time(6) + 1);
   ?column?    
---------------
 111160.123456
(1 row)

select ('2001-10-10 11:11:59.123456'::time(6) - 1);
   ?column?    
---------------
 111158.123456
(1 row)

select ('2001-10-10 11:11:59.123456'::time(6) / 2.0);
   ?column?   
--------------
 55579.561728
(1 row)

select ('2001-10-10 11:11:59.123456'::datetime(6) + 1);
     ?column?     
------------------
 20011010111160.1
(1 row)

select ('2001-10-10 11:11:59.123456'::datetime(6) - 1);
     ?column?     
------------------
 20011010111158.1
(1 row)

select ('2001-10-10 11:11:59.123456'::datetime(6) / 2.0);
     ?column?     
------------------
 10005505055579.6
(1 row)

-- test time type operations in not 'public' schema
select pg_typeof(year'2010' + interval '2' year);
 pg_typeof 
-----------
 year
(1 row)

select pg_typeof(year'2010' - interval '2' year);
 pg_typeof 
-----------
 year
(1 row)

select pg_typeof(time'01:01:01' + 1);
    pg_typeof     
------------------
 double precision
(1 row)

select pg_typeof(time'01:01:01' - 1);
    pg_typeof     
------------------
 double precision
(1 row)

select pg_typeof(datetime'2000-01-01 01:01:01' + 1);
    pg_typeof     
------------------
 double precision
(1 row)

select pg_typeof(datetime'2000-01-01 01:01:01' - 1);
    pg_typeof     
------------------
 double precision
(1 row)

create schema if not exists test_schema;
set current_schema to 'test_schema';
select pg_typeof(year'2010' + interval '2' year);
 pg_typeof 
-----------
 year
(1 row)

select pg_typeof(year'2010' - interval '2' year);
 pg_typeof 
-----------
 year
(1 row)

select pg_typeof(time'01:01:01' + 1);
    pg_typeof     
------------------
 double precision
(1 row)

select pg_typeof(time'01:01:01' - 1);
    pg_typeof     
------------------
 double precision
(1 row)

select pg_typeof(datetime'2000-01-01 01:01:01' + 1);
    pg_typeof     
------------------
 double precision
(1 row)

select pg_typeof(datetime'2000-01-01 01:01:01' - 1);
    pg_typeof     
------------------
 double precision
(1 row)

set current_schema to 'public';
drop schema if exists test_schema;
-- no strict mode
set dolphin.sql_mode = '';
CREATE TABLE time_tbl (v time);
INSERT INTO time_tbl VALUES('20220-01-01');
WARNING:  invalid input syntax for type time: "20220-01-01"
LINE 1: INSERT INTO time_tbl VALUES('20220-01-01');
                                    ^
CONTEXT:  referenced column: v
select * from time_tbl;
    v     
----------
 02:02:20
(1 row)

DROP TABLE time_tbl;
-- test sql_mode NO_ZERO_DATE
CREATE TABLE t_NO_ZERO_DATE_date(v date);
CREATE TABLE t_NO_ZERO_DATE_datetime(v datetime);
CREATE TABLE t_NO_ZERO_DATE_timestamp(v timestamp);
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES(0);
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-00');
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-01');
WARNING:  date/time field value out of range: "0000-00-01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-01');
                                                  ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-01-00');
WARNING:  date/time field value out of range: "0000-01-00"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-01-00');
                                                  ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('2000-00-00');
WARNING:  date/time field value out of range: "2000-00-00"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('2000-00-00');
                                                  ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-00 10:01');
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-01 10:01');
WARNING:  date/time field value out of range: "0000-00-01 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-01 10...
                                                      ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-01-00 10:01');
WARNING:  date/time field value out of range: "0000-01-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-01-00 10...
                                                      ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('2000-00-00 10:01');
WARNING:  date/time field value out of range: "2000-00-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('2000-00-00 10...
                                                      ^
CONTEXT:  referenced column: v
ERROR:  The value of month or day cannot be zero.
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('2000-00-00 10...
                                                      ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-00 10:01');
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-01 10:01');
WARNING:  date/time field value out of range: "0000-00-01 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-01 1...
                                                       ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-01-00 10:01');
WARNING:  date/time field value out of range: "0000-01-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-01-00 1...
                                                       ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('2000-00-00 10:01');
WARNING:  date/time field value out of range: "2000-00-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('2000-00-00 1...
                                                       ^
CONTEXT:  referenced column: v
ERROR:  The value of month or day cannot be zero.
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('2000-00-00 1...
                                                       ^
CONTEXT:  referenced column: v
SET dolphin.sql_mode = 'sql_mode_strict,sql_mode_full_group';
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES(0);
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-00');
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-01');
ERROR:  date/time field value out of range: "0000-00-01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-00-01');
                                                  ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-01-00');
ERROR:  date/time field value out of range: "0000-01-00"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('0000-01-00');
                                                  ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('2000-00-00');
ERROR:  date/time field value out of range: "2000-00-00"
LINE 1: INSERT INTO t_NO_ZERO_DATE_date(v) VALUES('2000-00-00');
                                                  ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-00 10:01');
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-01 10:01');
ERROR:  date/time field value out of range: "0000-00-01 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-00-01 10...
                                                      ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-01-00 10:01');
ERROR:  date/time field value out of range: "0000-01-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('0000-01-00 10...
                                                      ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('2000-00-00 10:01');
ERROR:  date/time field value out of range: "2000-00-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_datetime(v) VALUES('2000-00-00 10...
                                                      ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-00 10:01');
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-01 10:01');
ERROR:  date/time field value out of range: "0000-00-01 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-00-01 1...
                                                       ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-01-00 10:01');
ERROR:  date/time field value out of range: "0000-01-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('0000-01-00 1...
                                                       ^
CONTEXT:  referenced column: v
INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('2000-00-00 10:01');
ERROR:  date/time field value out of range: "2000-00-00 10:01"
LINE 1: INSERT INTO t_NO_ZERO_DATE_timestamp(v) VALUES('2000-00-00 1...
                                                       ^
CONTEXT:  referenced column: v
SELECT * FROM t_NO_ZERO_DATE_date order by v;
     v      
------------
 0000-00-00
 0000-00-00
 0000-00-00
 0000-00-00
 0000-00-00
 0000-00-00
 0000-00-00
(7 rows)

SELECT * FROM t_NO_ZERO_DATE_datetime order by v;
          v          
---------------------
 0000-00-00 00:00:00
 0000-00-00 00:00:00
 0000-00-00 10:01:00
 0000-00-00 10:01:00
(4 rows)

SELECT * FROM t_NO_ZERO_DATE_timestamp order by v;
              v               
------------------------------
 0000-00-00 00:00:00+08:05:43
 0000-00-00 00:00:00+08:05:43
 0000-00-00 10:01:00+08:05:43
 0000-00-00 10:01:00+08:05:43
(4 rows)

DROP TABLE t_NO_ZERO_DATE_date;
DROP TABLE t_NO_ZERO_DATE_datetime;
DROP TABLE t_NO_ZERO_DATE_timestamp;
RESET dolphin.sql_mode;
drop table if exists t_date;
NOTICE:  table "t_date" does not exist, skipping
drop table if exists t_datetime;
NOTICE:  table "t_datetime" does not exist, skipping
create table t_date(a date);
create table t_datetime(a datetime);
reset dolphin.sql_mode;
insert into t_date values('0000-00-00');
ERROR:  date/time field value out of range: "0000-00-00"
LINE 1: insert into t_date values('0000-00-00');
                                  ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: a
insert into t_datetime values('0000-00-00');
ERROR:  date/time field value out of range: "0000-00-00"
LINE 1: insert into t_datetime values('0000-00-00');
                                      ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: a
insert ignore into t_date values('0000-00-00');
WARNING:  date/time field value out of range: "0000-00-00"
LINE 1: insert ignore into t_date values('0000-00-00');
                                         ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: a
insert ignore into t_datetime values('0000-00-00');
WARNING:  date/time field value out of range: "0000-00-00"
LINE 1: insert ignore into t_datetime values('0000-00-00');
                                             ^
HINT:  Perhaps you need a different "datestyle" setting.
CONTEXT:  referenced column: a
select * from t_date;
     a      
------------
 0000-00-00
(1 row)

select * from t_datetime;
          a          
---------------------
 0000-00-00 00:00:00
(1 row)

set dolphin.sql_mode = 'no_zero_date';
insert into t_date values('0000-00-00');
WARNING:  date/time field value out of range: "0000-00-00"
LINE 1: insert into t_date values('0000-00-00');
                                  ^
CONTEXT:  referenced column: a
insert into t_datetime values('0000-00-00');
WARNING:  date/time field value out of range: "0000-00-00"
LINE 1: insert into t_datetime values('0000-00-00');
                                      ^
CONTEXT:  referenced column: a
insert ignore into t_date values('0000-00-00');
WARNING:  date/time field value out of range: "0000-00-00"
LINE 1: insert ignore into t_date values('0000-00-00');
                                         ^
CONTEXT:  referenced column: a
insert ignore into t_datetime values('0000-00-00');
WARNING:  date/time field value out of range: "0000-00-00"
LINE 1: insert ignore into t_datetime values('0000-00-00');
                                             ^
CONTEXT:  referenced column: a
select * from t_date;
     a      
------------
 0000-00-00
 0000-00-00
 0000-00-00
(3 rows)

select * from t_datetime;
          a          
---------------------
 0000-00-00 00:00:00
 0000-00-00 00:00:00
 0000-00-00 00:00:00
(3 rows)

set dolphin.sql_mode = 'sql_mode_strict';
insert into t_date values('0000-00-00');
insert into t_datetime values('0000-00-00');
insert ignore into t_date values('0000-00-00');
insert ignore into t_datetime values('0000-00-00');
select * from t_date;
     a      
------------
 0000-00-00
 0000-00-00
 0000-00-00
 0000-00-00
 0000-00-00
(5 rows)

select * from t_datetime;
          a          
---------------------
 0000-00-00 00:00:00
 0000-00-00 00:00:00
 0000-00-00 00:00:00
 0000-00-00 00:00:00
 0000-00-00 00:00:00
(5 rows)

set dolphin.sql_mode = '';
insert into t_date values('0000-00-00');
insert into t_datetime values('0000-00-00');
insert ignore into t_date values('0000-00-00');
insert ignore into t_datetime values('0000-00-00');
select * from t_date;
     a      
------------
 0000-00-00
 0000-00-00
 0000-00-00
 0000-00-00
 0000-00-00
 0000-00-00
 0000-00-00
(7 rows)

select * from t_datetime;
          a          
---------------------
 0000-00-00 00:00:00
 0000-00-00 00:00:00
 0000-00-00 00:00:00
 0000-00-00 00:00:00
 0000-00-00 00:00:00
 0000-00-00 00:00:00
 0000-00-00 00:00:00
(7 rows)

SET TIME ZONE PRC;
CREATE TABLE test_timestamp(ts timestamp(2));
INSERT INTO test_timestamp VALUES ('2012-10-21 23:55:23-12:12');
INSERT INTO test_timestamp VALUES (201112234512);
SELECT * FROM test_timestamp;
           ts           
------------------------
 2012-10-22 20:07:23+08
 2020-11-12 23:45:12+08
(2 rows)

SET TIME ZONE UTC;
SELECT * FROM test_timestamp;
           ts           
------------------------
 2012-10-22 12:07:23+00
 2020-11-12 15:45:12+00
(2 rows)

drop table if exists t_date;
drop table if exists t_datetime;
drop table if exists test_timestamp;
set dolphin.b_compatibility_mode = true;
select cast(true as date) as result;
WARNING:  Out of range value for date
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(false as date) as result;
   result   
------------
 0000-00-00
(1 row)

select cast(100::int1 as date) as result;
WARNING:  Out of range value for date
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::uint1 as date) as result;
WARNING:  Out of range value for date
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::int2 as date) as result;
WARNING:  Out of range value for date
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::uint2 as date) as result;
WARNING:  Out of range value for date
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::int4 as date) as result;
WARNING:  Out of range value for date
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::uint4 as date) as result;
WARNING:  Out of range value for date
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::int4 as date) as result;
WARNING:  Out of range value for date
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::uint8 as date) as result;
WARNING:  Out of range value for date
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::float4 as date) as result;
WARNING:  date/time field value out of range: "000100"
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::float8 as date) as result;
WARNING:  date/time field value out of range: "000100"
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::numeric as date) as result;
WARNING:  date/time field value out of range: "000100"
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::int1 as datetime) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::uint1 as datetime) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::int2 as datetime) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::uint2 as datetime) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::int4 as datetime) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::uint4 as datetime) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::int8 as datetime) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::uint8 as datetime) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::float4 as datetime) as result;
WARNING:  date/time field value out of range: "000100"
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::float8 as datetime) as result;
WARNING:  date/time field value out of range: "000100"
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::numeric as datetime) as result;
WARNING:  date/time field value out of range: "000100"
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::int1 as timestamp with time zone) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::uint1 as timestamp with time zone) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::int2 as timestamp with time zone) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::uint2 as timestamp with time zone) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::int4 as timestamp with time zone) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::uint4 as timestamp with time zone) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::int8 as timestamp with time zone) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::uint8 as timestamp with time zone) as result;
WARNING:  timestamp out of range
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::float4 as timestamp with time zone) as result;
WARNING:  date/time field value out of range: "000100"
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::float8 as timestamp with time zone) as result;
WARNING:  date/time field value out of range: "000100"
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select cast(100::numeric as timestamp with time zone) as result;
WARNING:  date/time field value out of range: "000100"
CONTEXT:  referenced column: result
 result 
--------
 
(1 row)

select unix_timestamp(1.5);
WARNING:  date/time field value out of range: "000001.5"
CONTEXT:  referenced column: unix_timestamp
 unix_timestamp 
----------------
              0
(1 row)

select cast('4714-11-24 10:10:10 BC' as date);
     date      
---------------
 4714-11-24 BC
(1 row)

select cast('4714-11-24 10:10:10 BC' as timestamp with time zone);
        timestamptz        
---------------------------
 4714-11-24 10:10:10+00 BC
(1 row)

select cast('4714-11-24 10:10:10 BC' as datetime);
       timestamp        
------------------------
 4714-11-24 10:10:10 BC
(1 row)

select cast('-100-11-24 BC' as date);
WARNING:  time zone displacement out of range: "-100-11-24 BC"
LINE 1: select cast('-100-11-24 BC' as date);
                    ^
CONTEXT:  referenced column: date
 date 
------
 
(1 row)

select cast('4715-11-24 10:10:10 BC' as date);
WARNING:  date out of range: "4715-11-24 10:10:10 bc"
LINE 1: select cast('4715-11-24 10:10:10 BC' as date);
                    ^
CONTEXT:  referenced column: date
 date 
------
 
(1 row)

select cast('4715-11-24 10:10:10 BC' as timestamp with time zone);
WARNING:  timestamp out of range: "4715-11-24 10:10:10 bc"
LINE 1: select cast('4715-11-24 10:10:10 BC' as timestamp with time ...
                    ^
CONTEXT:  referenced column: timestamptz
 timestamptz 
-------------
 
(1 row)

select cast('4715-11-24 10:10:10 BC' as datetime);
WARNING:  timestamp out of range: "4715-11-24 10:10:10 bc"
LINE 1: select cast('4715-11-24 10:10:10 BC' as datetime);
                    ^
CONTEXT:  referenced column: timestamp
 timestamp 
-----------
 
(1 row)

create table t1(c1 date, c2 datetime, c3 timestamp with time zone);
insert into t1 values ('4714-11-24 BC', '4714-11-24 10:10:10 BC', '4714-11-24 10:10:10 BC');
insert ignore into t1 values ('4715-11-24 BC', '4715-11-24 10:10:10 BC', '4715-11-24 10:10:10 BC');
WARNING:  date out of range: "4715-11-24 bc"
LINE 1: insert ignore into t1 values ('4715-11-24 BC', '4715-11-24 1...
                                      ^
CONTEXT:  referenced column: c1
WARNING:  timestamp out of range: "4715-11-24 10:10:10 bc"
LINE 1: insert ignore into t1 values ('4715-11-24 BC', '4715-11-24 1...
                                                       ^
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range: "4715-11-24 10:10:10 bc"
LINE 1: ...alues ('4715-11-24 BC', '4715-11-24 10:10:10 BC', '4715-11-2...
                                                             ^
CONTEXT:  referenced column: c3
select * from t1 order by 1;
      c1       |           c2           |            c3             
---------------+------------------------+---------------------------
 4714-11-24 BC | 4714-11-24 10:10:10 BC | 4714-11-24 10:10:10+00 BC
 0000-00-00    | 0000-00-00 00:00:00    | 0000-00-00 00:00:00+00
(2 rows)

drop table t1;
select cast(0::boolean as time);
   time   
----------
 00:00:00
(1 row)

select cast(0::boolean as date);
    date    
------------
 0000-00-00
(1 row)

select cast(0::boolean as datetime);
WARNING:  timestamp out of range
CONTEXT:  referenced column: timestamp
      timestamp      
---------------------
 0000-00-00 00:00:00
(1 row)

select cast(0::boolean as timestamp);
WARNING:  timestamp out of range
CONTEXT:  referenced column: timestamptz
      timestamptz       
------------------------
 0000-00-00 00:00:00+00
(1 row)

select cast(1::boolean as time);
   time   
----------
 00:00:01
(1 row)

select cast(1::boolean as date);
WARNING:  Out of range value for date
CONTEXT:  referenced column: date
 date 
------
 
(1 row)

select cast(1::boolean as datetime);
WARNING:  timestamp out of range
CONTEXT:  referenced column: timestamp
 timestamp 
-----------
 
(1 row)

select cast(1::boolean as timestamp);
WARNING:  timestamp out of range
CONTEXT:  referenced column: timestamptz
 timestamptz 
-------------
 
(1 row)

create table boolean_test_time(a time);
create table boolean_test_date(a date);
create table boolean_test_datetime(a datetime);
create table boolean_test_timestamp(a timestamp);
insert into boolean_test_time values(0::boolean);
insert into boolean_test_date values(0::boolean);
insert into boolean_test_datetime values(0::boolean);
WARNING:  timestamp out of range
CONTEXT:  referenced column: a
insert into boolean_test_timestamp values(0::boolean);
WARNING:  timestamp out of range
CONTEXT:  referenced column: a
insert into boolean_test_time values(1::boolean);
insert into boolean_test_date values(1::boolean);
WARNING:  Out of range value for date
CONTEXT:  referenced column: a
insert into boolean_test_datetime values(1::boolean);
WARNING:  timestamp out of range
CONTEXT:  referenced column: a
insert into boolean_test_timestamp values(1::boolean);
WARNING:  timestamp out of range
CONTEXT:  referenced column: a
set dolphin.sql_mode = '';
insert into boolean_test_time values(0::boolean);
insert into boolean_test_date values(0::boolean);
insert into boolean_test_datetime values(0::boolean);
WARNING:  timestamp out of range
CONTEXT:  referenced column: a
insert into boolean_test_timestamp values(0::boolean);
WARNING:  timestamp out of range
CONTEXT:  referenced column: a
insert into boolean_test_time values(1::boolean);
insert into boolean_test_date values(1::boolean);
WARNING:  Out of range value for date
CONTEXT:  referenced column: a
insert into boolean_test_datetime values(1::boolean);
WARNING:  timestamp out of range
CONTEXT:  referenced column: a
insert into boolean_test_timestamp values(1::boolean);
WARNING:  timestamp out of range
CONTEXT:  referenced column: a
select * from boolean_test_time;
    a     
----------
 00:00:00
 00:00:01
 00:00:00
 00:00:01
(4 rows)

select * from boolean_test_date;
     a      
------------
 0000-00-00
 0000-00-00
 0000-00-00
 0000-00-00
(4 rows)

select * from boolean_test_datetime;
          a          
---------------------
 0000-00-00 00:00:00
 0000-00-00 00:00:00
 0000-00-00 00:00:00
 0000-00-00 00:00:00
(4 rows)

select * from boolean_test_timestamp;
           a            
------------------------
 0000-00-00 00:00:00+00
 0000-00-00 00:00:00+00
 0000-00-00 00:00:00+00
 0000-00-00 00:00:00+00
(4 rows)

reset dolphin.sql_mode;
set dolphin.b_compatibility_mode=on;
set b_format_behavior_compat_options=enable_set_variables;
create table t_bigint0005(
    c1 bigint,
    c2 bigint,
    c3 bigint(1),
    c4 bigint(255),
    c5 bigint default '10',
    c6 bigint auto_increment primary key,
    c7 bigint(1) default 0,
    c8 bigint(10) not null default 99,
    c9 bigint unique);
NOTICE:  CREATE TABLE will create implicit sequence "t_bigint0005_c6_seq" for serial column "t_bigint0005.c6"
NOTICE:  CREATE TABLE / PRIMARY KEY will create implicit index "t_bigint0005_pkey" for table "t_bigint0005"
NOTICE:  CREATE TABLE / UNIQUE will create implicit index "t_bigint0005_c9_key" for table "t_bigint0005"
set @val = '-9223372036854775808';
insert t_bigint0005 values(1, @val, @val, @val, @val, @val, @val, @val, @val);
set @val = '121314' + 1;
insert t_bigint0005 values(2, @val, @val, @val, @val, @val, @val, @val, @val);
set @val = cast(1234 as unsigned);
insert t_bigint0005 values(3, @val, @val, @val, @val, @val, @val, @val, @val);
set @val = cast(-123456789 as signed);
insert t_bigint0005 values(4, @val, @val, @val, @val, @val, @val, @val, @val);
set @val = cast(123456789101112 as char);
insert t_bigint0005 values(5, @val, @val, @val, @val, @val, @val, @val, @val);
set @val = 255 * 255 * 255;
insert t_bigint0005 values(6, @val, @val, @val, @val, @val, @val, @val, @val);
set @val = 9223372036854775807;
insert t_bigint0005 values(7, @val, @val, @val, @val, @val, @val, @val, @val);
select c1, cast(c2 as date), cast(c3 as date), cast(c4 as date), cast(c5 as date), cast(c6 as date), cast(c7 as date), cast(c8 as date), cast(c9 as date)
from t_bigint0005 order by 1,2,3,4,5,6,7,8,9;
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  Out of range value for date
CONTEXT:  referenced column: c2
WARNING:  Out of range value for date
CONTEXT:  referenced column: c3
WARNING:  Out of range value for date
CONTEXT:  referenced column: c4
WARNING:  Out of range value for date
CONTEXT:  referenced column: c5
WARNING:  Out of range value for date
CONTEXT:  referenced column: c6
WARNING:  Out of range value for date
CONTEXT:  referenced column: c7
WARNING:  Out of range value for date
CONTEXT:  referenced column: c8
WARNING:  Out of range value for date
CONTEXT:  referenced column: c9
WARNING:  Out of range value for date
CONTEXT:  referenced column: c2
WARNING:  Out of range value for date
CONTEXT:  referenced column: c3
WARNING:  Out of range value for date
CONTEXT:  referenced column: c4
WARNING:  Out of range value for date
CONTEXT:  referenced column: c5
WARNING:  Out of range value for date
CONTEXT:  referenced column: c6
WARNING:  Out of range value for date
CONTEXT:  referenced column: c7
WARNING:  Out of range value for date
CONTEXT:  referenced column: c8
WARNING:  Out of range value for date
CONTEXT:  referenced column: c9
WARNING:  Out of range value for date
CONTEXT:  referenced column: c2
WARNING:  Out of range value for date
CONTEXT:  referenced column: c3
WARNING:  Out of range value for date
CONTEXT:  referenced column: c4
WARNING:  Out of range value for date
CONTEXT:  referenced column: c5
WARNING:  Out of range value for date
CONTEXT:  referenced column: c6
WARNING:  Out of range value for date
CONTEXT:  referenced column: c7
WARNING:  Out of range value for date
CONTEXT:  referenced column: c8
WARNING:  Out of range value for date
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  Out of range value for date
CONTEXT:  referenced column: c2
WARNING:  Out of range value for date
CONTEXT:  referenced column: c3
WARNING:  Out of range value for date
CONTEXT:  referenced column: c4
WARNING:  Out of range value for date
CONTEXT:  referenced column: c5
WARNING:  Out of range value for date
CONTEXT:  referenced column: c6
WARNING:  Out of range value for date
CONTEXT:  referenced column: c7
WARNING:  Out of range value for date
CONTEXT:  referenced column: c8
WARNING:  Out of range value for date
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
 c1 | c2 | c3 | c4 | c5 | c6 | c7 | c8 | c9 
----+----+----+----+----+----+----+----+----
  1 |    |    |    |    |    |    |    | 
  2 |    |    |    |    |    |    |    | 
  3 |    |    |    |    |    |    |    | 
  4 |    |    |    |    |    |    |    | 
  5 |    |    |    |    |    |    |    | 
  6 |    |    |    |    |    |    |    | 
  7 |    |    |    |    |    |    |    | 
(7 rows)

select c1, cast(c2 as time), cast(c3 as time), cast(c4 as time), cast(c5 as time), cast(c6 as time), cast(c7 as time), cast(c8 as time), cast(c9 as time)
from t_bigint0005 order by 1,2,3,4,5,6,7,8,9;
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  invalid input syntax for type time: "-123456789"
CONTEXT:  referenced column: c2
WARNING:  invalid input syntax for type time: "-123456789"
CONTEXT:  referenced column: c3
WARNING:  invalid input syntax for type time: "-123456789"
CONTEXT:  referenced column: c4
WARNING:  invalid input syntax for type time: "-123456789"
CONTEXT:  referenced column: c5
WARNING:  invalid input syntax for type time: "-123456789"
CONTEXT:  referenced column: c6
WARNING:  invalid input syntax for type time: "-123456789"
CONTEXT:  referenced column: c7
WARNING:  invalid input syntax for type time: "-123456789"
CONTEXT:  referenced column: c8
WARNING:  invalid input syntax for type time: "-123456789"
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  invalid input syntax for type time: "16581375"
CONTEXT:  referenced column: c2
WARNING:  invalid input syntax for type time: "16581375"
CONTEXT:  referenced column: c3
WARNING:  invalid input syntax for type time: "16581375"
CONTEXT:  referenced column: c4
WARNING:  invalid input syntax for type time: "16581375"
CONTEXT:  referenced column: c5
WARNING:  invalid input syntax for type time: "16581375"
CONTEXT:  referenced column: c6
WARNING:  invalid input syntax for type time: "16581375"
CONTEXT:  referenced column: c7
WARNING:  invalid input syntax for type time: "16581375"
CONTEXT:  referenced column: c8
WARNING:  invalid input syntax for type time: "16581375"
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
 c1 |    c2    |    c3    |    c4    |    c5    |    c6    |    c7    |    c8    |    c9    
----+----------+----------+----------+----------+----------+----------+----------+----------
  1 |          |          |          |          |          |          |          | 
  2 | 12:13:15 | 12:13:15 | 12:13:15 | 12:13:15 | 12:13:15 | 12:13:15 | 12:13:15 | 12:13:15
  3 | 00:12:34 | 00:12:34 | 00:12:34 | 00:12:34 | 00:12:34 | 00:12:34 | 00:12:34 | 00:12:34
  4 |          |          |          |          |          |          |          | 
  5 |          |          |          |          |          |          |          | 
  6 |          |          |          |          |          |          |          | 
  7 |          |          |          |          |          |          |          | 
(7 rows)

select c1, cast(c2 as datetime), cast(c3 as datetime), cast(c4 as datetime), cast(c5 as datetime), cast(c6 as datetime), cast(c7 as datetime), cast(c8 as datetime), cast(c9 as datetime)
from t_bigint0005 order by 1,2,3,4,5,6,7,8,9;
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
 c1 | c2 | c3 | c4 | c5 | c6 | c7 | c8 | c9 
----+----+----+----+----+----+----+----+----
  1 |    |    |    |    |    |    |    | 
  2 |    |    |    |    |    |    |    | 
  3 |    |    |    |    |    |    |    | 
  4 |    |    |    |    |    |    |    | 
  5 |    |    |    |    |    |    |    | 
  6 |    |    |    |    |    |    |    | 
  7 |    |    |    |    |    |    |    | 
(7 rows)

select c1, cast(c2 as timestamp with time zone), cast(c3 as timestamp with time zone), cast(c4 as timestamp with time zone), cast(c5 as timestamp with time zone), cast(c6 as timestamp with time zone), cast(c7 as timestamp with time zone), cast(c8 as timestamp with time zone), cast(c9 as timestamp with time zone)
from t_bigint0005 order by 1,2,3,4,5,6,7,8,9;
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
WARNING:  timestamp out of range
CONTEXT:  referenced column: c2
WARNING:  timestamp out of range
CONTEXT:  referenced column: c3
WARNING:  timestamp out of range
CONTEXT:  referenced column: c4
WARNING:  timestamp out of range
CONTEXT:  referenced column: c5
WARNING:  timestamp out of range
CONTEXT:  referenced column: c6
WARNING:  timestamp out of range
CONTEXT:  referenced column: c7
WARNING:  timestamp out of range
CONTEXT:  referenced column: c8
WARNING:  timestamp out of range
CONTEXT:  referenced column: c9
 c1 | c2 | c3 | c4 | c5 | c6 | c7 | c8 | c9 
----+----+----+----+----+----+----+----+----
  1 |    |    |    |    |    |    |    | 
  2 |    |    |    |    |    |    |    | 
  3 |    |    |    |    |    |    |    | 
  4 |    |    |    |    |    |    |    | 
  5 |    |    |    |    |    |    |    | 
  6 |    |    |    |    |    |    |    | 
  7 |    |    |    |    |    |    |    | 
(7 rows)

create table t_fixed0005(
    c1 int,
    c2 fixed,
    c3 fixed(10, 0),
    c4 fixed(7, 2),
    c5 fixed(30, 10),
    c6 fixed(65, 8),
    c7 fixed(65, 30),
    c8 fixed(10, 3),
    c9 fixed(5),
    c10 fixed(12, 6));
set @val = 12.1314;
insert into t_fixed0005 values (1, @val, @val, @val, @val, @val, @val, @val, @val, @val);
select c1, cast(c2 as date), cast(c3 as date), cast(c4 as date), cast(c5 as date), cast(c6 as date), cast(c7 as date), cast(c8 as date), cast(c9 as date)
from t_fixed0005 order by 1,2,3,4,5,6,7,8,9;
WARNING:  date/time field value out of range: "000012"
CONTEXT:  referenced column: c2
WARNING:  date/time field value out of range: "000012"
CONTEXT:  referenced column: c3
WARNING:  date/time field value out of range: "000012.13"
CONTEXT:  referenced column: c4
WARNING:  invalid input syntax for type timestamp: "000012.1314000000"
CONTEXT:  referenced column: c5
WARNING:  invalid input syntax for type timestamp: "000012.13140000"
CONTEXT:  referenced column: c6
WARNING:  invalid input syntax for type timestamp: "000012.131400000000000000000000000000"
CONTEXT:  referenced column: c7
WARNING:  date/time field value out of range: "000012.131"
CONTEXT:  referenced column: c8
WARNING:  date/time field value out of range: "000012"
CONTEXT:  referenced column: c9
 c1 | c2 | c3 | c4 | c5 | c6 | c7 | c8 | c9 
----+----+----+----+----+----+----+----+----
  1 |    |    |    |    |    |    |    | 
(1 row)

select c1, cast(c2 as time), cast(c3 as time), cast(c4 as time), cast(c5 as time), cast(c6 as time), cast(c7 as time), cast(c8 as time), cast(c9 as time)
from t_fixed0005 order by 1,2,3,4,5,6,7,8,9;
 c1 |    c2    |    c3    |    c4    |    c5    |    c6    |    c7    |    c8    |    c9    
----+----------+----------+----------+----------+----------+----------+----------+----------
  1 | 00:00:12 | 00:00:12 | 00:00:12 | 00:00:12 | 00:00:12 | 00:00:12 | 00:00:12 | 00:00:12
(1 row)

select c1, cast(c2 as datetime), cast(c3 as datetime), cast(c4 as datetime), cast(c5 as datetime), cast(c6 as datetime), cast(c7 as datetime), cast(c8 as datetime), cast(c9 as datetime)
from t_fixed0005 order by 1,2,3,4,5,6,7,8,9;
WARNING:  date/time field value out of range: "000012"
CONTEXT:  referenced column: c2
WARNING:  date/time field value out of range: "000012"
CONTEXT:  referenced column: c3
WARNING:  date/time field value out of range: "000012.13"
CONTEXT:  referenced column: c4
WARNING:  invalid input syntax for type timestamp: "000012.1314000000"
CONTEXT:  referenced column: c5
WARNING:  invalid input syntax for type timestamp: "000012.13140000"
CONTEXT:  referenced column: c6
WARNING:  invalid input syntax for type timestamp: "000012.131400000000000000000000000000"
CONTEXT:  referenced column: c7
WARNING:  date/time field value out of range: "000012.131"
CONTEXT:  referenced column: c8
WARNING:  date/time field value out of range: "000012"
CONTEXT:  referenced column: c9
 c1 | c2 | c3 | c4 | c5 | c6 | c7 | c8 | c9 
----+----+----+----+----+----+----+----+----
  1 |    |    |    |    |    |    |    | 
(1 row)

select c1, cast(c2 as timestamp with time zone), cast(c3 as timestamp with time zone), cast(c4 as timestamp with time zone), cast(c5 as timestamp with time zone), cast(c6 as timestamp with time zone), cast(c7 as timestamp with time zone), cast(c8 as timestamp with time zone), cast(c9 as timestamp with time zone)
from t_fixed0005 order by 1,2,3,4,5,6,7,8,9;
WARNING:  date/time field value out of range: "000012"
CONTEXT:  referenced column: c2
WARNING:  date/time field value out of range: "000012"
CONTEXT:  referenced column: c3
WARNING:  date/time field value out of range: "000012.13"
CONTEXT:  referenced column: c4
WARNING:  invalid input syntax for type timestamp: "000012.1314000000"
CONTEXT:  referenced column: c5
WARNING:  invalid input syntax for type timestamp: "000012.13140000"
CONTEXT:  referenced column: c6
WARNING:  invalid input syntax for type timestamp: "000012.131400000000000000000000000000"
CONTEXT:  referenced column: c7
WARNING:  date/time field value out of range: "000012.131"
CONTEXT:  referenced column: c8
WARNING:  date/time field value out of range: "000012"
CONTEXT:  referenced column: c9
 c1 | c2 | c3 | c4 | c5 | c6 | c7 | c8 | c9 
----+----+----+----+----+----+----+----+----
  1 |    |    |    |    |    |    |    | 
(1 row)

drop table t_bigint0005;
drop table t_fixed0005;
create table t_year_0001(c1 int not null, c2 year default '0000', c3 year default null, c4 year default '1999', c5 year);
insert into t_year_0001 values (1, now(), now(), now(), now());
insert into t_year_0001 values (2, curdate(), curdate(), curdate(), curdate());
insert into t_year_0001 values (3, current_timestamp(), current_timestamp(), current_timestamp(), current_timestamp());
select * from t_year_0001;
 c1 |  c2  |  c3  |  c4  |  c5  
----+------+------+------+------
--?.*
--?.*
--?.*
(3 rows)

drop table t_year_0001;
\c postgres
DROP DATABASE b_time_type;
DROP TABLESPACE b_time_type_example;
